
&НаКлиенте
Процедура ВыбратьФотографию(Команда)
	
	ВыбраннаяЗапись = Элементы.Фотографии.ТекущиеДанные;
	Если ВыбраннаяЗапись = Неопределено Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю("Не выделена ни одна фотография!");
		Возврат;
	КонецЕсли;
	
	ДанныеЗаписи = Новый Структура("Кошка,ИмяФайла");
	ДанныеЗаписи.Кошка    = ВыбраннаяЗапись.Кошка;
	ДанныеЗаписи.ИмяФайла = ВыбраннаяЗапись.ИмяФайла;
	
	Закрыть(ДанныеЗаписи);
	
КонецПроцедуры

//&НаКлиенте
//Процедура КошкаПриИзменении(Элемент)
//	
//	Если ЗначениеЗаполнено(Кошка) Тогда
//		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(
//			Фотографии, "Кошка", Кошка, ВидСравненияКомпоновкиДанных.Равно, "ОтборПоКошке");
//	Иначе
//		ЭлементОтбора = ОбщегоНазначенияКлиентСервер.НайтиЭлементОтбораПоПредставлению(Фотографии.Отбор.Элементы, "ОтборПоКошке");
//		Фотографии.Отбор.Элементы.Удалить(ЭлементОтбора);
//	КонецЕсли;
//	
//КонецПроцедуры
