#Область ОписаниеПеременных

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	ПротоколОсмотра = ТекущийОбъект.РезультатОсмотра.Получить();
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	ТекущийОбъект.РезультатОсмотра = Новый ХранилищеЗначения(ПротоколОсмотра); 
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ШаблонПриИзменении(Элемент)
	
	ПротоколОсмотра = ШаблонПротоколаОсмотра(Шаблон);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервереБезКонтекста
Функция ШаблонПротоколаОсмотра(Шаблон)
	
	ШаблонПротоколаХЗ = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Шаблон, "ШаблонПротоколаОсмотра");
	ШаблонПротокола = ШаблонПротоколаХЗ.Получить();
	Возврат ШаблонПротокола;
	
КонецФункции

#КонецОбласти