#Область ОписаниеПеременных

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	ПротоколОсмотра = ТекущийОбъект.РезультатОсмотра.Получить();
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	ТекущийОбъект.РезультатОсмотра = Новый ХранилищеЗначения(ПротоколОсмотра); 
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ШаблонПриИзменении(Элемент)
	
	//Если НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда
	//	ПротоколОсмотра = ШаблонПротоколаОсмотра(Объект.Шаблон);
	//Иначе
		Оповещение = Новый ОписаниеОповещения("ИзменениеШаблонаЗавершение", ЭтаФорма, Неопределено);
		ТекстВопроса = "Изменение шаблона приведет к очистке заполнения протокола. Продолжить?";
		ПоказатьВопрос(Оповещение, ТекстВопроса, РежимДиалогаВопрос.ДаНет);
	//КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ИзменениеШаблонаЗавершение(Результат, ДополнительныеПараметры = Неопределено) Экспорт
	
	Если Результат = КодВозвратаДиалога.Нет Тогда
		Возврат;
	КонецЕсли;
	
	ПротоколОсмотра = ШаблонПротоколаОсмотра(Объект.Шаблон);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервереБезКонтекста
Функция ШаблонПротоколаОсмотра(Шаблон)
	
	ШаблонПротоколаХЗ = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Шаблон, "ШаблонПротоколаОсмотра");
	ШаблонПротокола = ШаблонПротоколаХЗ.Получить();
	Возврат ШаблонПротокола;
	
КонецФункции

#КонецОбласти