
Процедура ОбработкаПроведения(Отказ, Режим)
	
	// регистр ОстаткиРасходников Расход
	Движения.ОстаткиРасходников.Записывать = Истина;
	Движение = Движения.ОстаткиРасходников.Добавить();
	Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
	Движение.Период = Дата;
	Движение.Расходник = Микрочип;
	Движение.Количество = 1;
	
	// регистр НомераМикрочипов
	Движения.НомераМикрочипов.Записывать = Истина;
	Движение = Движения.НомераМикрочипов.Добавить();
	Движение.Период = Дата;
	Движение.Кошка = Кошка;
	Движение.НомерМикрочипа = НомерМикрочипа;

КонецПроцедуры
