
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Объект.Ссылка.Пустая() Тогда
		Объект.ПериодРегистрации = НачалоМесяца(ТекущаяДатаСеанса());
	КонецЕсли;
	
	ОформитьЗаголовокШапки();
	
КонецПроцедуры

&НаСервере
Процедура ОформитьЗаголовокШапки()
	
	ДлинаСуток = 3600 * 24;
	
	// 3. Получение колонок табличной части формы
	Колонки = Элементы.ДанныеОВремени.ПодчиненныеЭлементы;
	НачалоПериода = НачалоМесяца(Объект.ПериодРегистрации);
	
	ДеньМесяца = 1;
	
	// 4. Обход циклом всех колонок
	Для Каждого Колонка Из Колонки Цикл
		
		Если Колонка.Имя = "ДанныеОВремениГруппа" + ДеньМесяца Тогда
			ПоляШапки = Колонка.ПодчиненныеЭлементы;
			ПолеШапки = ПоляШапки["ДанныеОВремениВидВремени" + ДеньМесяца];
			ПолеПустышка = ПоляШапки["ДанныеОВремениДень" + ДеньМесяца];
			
			// 5. Получение колонки с нужной датой
			Период = НачалоПериода + (ДеньМесяца - 1) * ДлинаСуток;
			
			// 6. Если период не попадает в интервал текущего месяца, то скрываем колонку
			Если Период > КонецМесяца(НачалоПериода) Тогда
				ПолеШапки.Видимость = Ложь;
				ПолеПустышка.Видимость = Ложь;
			Иначе
				// 7. Оформление колонок в формате "10-Пн"
				ПолеШапки.Заголовок = Формат(Период, "ДФ=dd") + "-" + Формат(Период,"ДФ=ddd");
				ПолеШапки.Видимость = Истина;
				
				ПолеПустышка.Заголовок = " ";
				ПолеПустышка.Видимость = Истина;
			КонецЕсли;
			
			ДеньМесяца = ДеньМесяца + 1;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ПериодРегистрацииПриИзменении(Элемент)
	
	ОформитьЗаголовокШапки();
	
КонецПроцедуры
