
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Объект.Ссылка.Пустая() Тогда
		Объект.ПериодРегистрации = НачалоМесяца(ТекущаяДатаСеанса());
	КонецЕсли;
	
	ОформитьЗаголовокШапки();
	
КонецПроцедуры

&НаСервере
Процедура ОформитьЗаголовокШапки()
	
	ДлинаСуток = 3600 * 24;
	
	// 3. Получение колонок табличной части формы
	Колонки = Элементы.ДанныеОВремени.ПодчиненныеЭлементы;
	НачалоПериода = НачалоМесяца(Объект.ПериодРегистрации);
	
	// 4. Обход циклом всех колонок
	Для ДеньМесяца = 1 По 31 Цикл
		
		// 5. Получение колонки с нужной датой
		ПолеШапки = Колонки["ДанныеОВремениДень" + ДеньМесяца + "Представление"];
		Период = НачалоПериода + (ДеньМесяца - 1) * ДлинаСуток;
		
		// 6. Если период не попадает в интервал текущего месяца, то скрываем колонку
		Если Период > КонецМесяца(НачалоПериода) Тогда
			ПолеШапки.Видимость = Ложь;
		Иначе
			// 7. Оформление колонок в формате "10-Пн"
			ПолеШапки.Заголовок = Формат(Период, "ДФ=dd") + "-" + Формат(Период,"ДФ=ddd");
			ПолеШапки.Видимость = Истина;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры


&НаСервереБезКонтекста
Процедура ДанныеОВремениДеньПредставлениеНачалоВыбораНаСервере()
	// Вставить содержимое обработчика.
КонецПроцедуры


&НаКлиенте
Процедура ДанныеОВремениДеньПредставлениеНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	ДанныеОВремениДеньПредставлениеНачалоВыбораНаСервере();
КонецПроцедуры


&НаКлиенте
Процедура ДанныеОВремениДень1ПредставлениеОкончаниеВводаТекста(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, СтандартнаяОбработка)
	// Вставить содержимое обработчика.
КонецПроцедуры

