
Процедура ОбработкаПроведения(Отказ, Режим)

	// регистр ГрафикУборкиМестСодержанияПодопечных
	Движения.ГрафикУборкиМестСодержанияПодопечных.Записывать = Истина;
	Движение = Движения.ГрафикУборкиМестСодержанияПодопечных.Добавить();
	Движение.Период = Дата;
	Движение.Кошка = Кошка;
	Движение.Убрано = Истина;

	// регистр ОстаткиРасходников Расход
	Движения.ОстаткиРасходников.Записывать = Истина;
	Для Каждого ТекСтрокаРасходники Из Расходники Цикл
		Движение = Движения.ОстаткиРасходников.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
		Движение.Период = Дата;
		Движение.Расходник = ТекСтрокаРасходники.Расходник;
		Движение.Количество = ТекСтрокаРасходники.Количество;
	КонецЦикла;

КонецПроцедуры
