
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ПараметрКомпоновки = Новый ПараметрКомпоновкиДанных("Период");
	ПараметрСКД = Отчет.КомпоновщикНастроек.Настройки.ПараметрыДанных.НайтиЗначениеПараметра(ПараметрКомпоновки);
	ПараметрСКД.Значение = ОбщегоНазначенияКлиент.ДатаСеанса();
	ПараметрСКД.Использование = Истина;
	
	Если ЗначениеЗаполнено(ПараметрСКД.ИдентификаторПользовательскойНастройки) Тогда
		
		ПользовательскийПараметр = Отчет.КомпоновщикНастроек.ПользовательскиеНастройки.Элементы.Найти(
			ПараметрСКД.ИдентификаторПользовательскойНастройки);
		Если ТипЗнч(ПользовательскийПараметр) = Тип("ЗначениеПараметраНастроекКомпоновкиДанных") Тогда
			ПользовательскийПараметр.Значение = ПараметрСКД.Значение;
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры
