
Процедура ОбработкаПроведения(Отказ, Режим)

	// регистр ГрафикПолученияКормаПодопечными
	Движения.ГрафикПолученияКормаПодопечными.Записывать = Истина;
	Для Каждого ТекСтрокаРасходники Из Расходники Цикл
		Движение = Движения.ГрафикПолученияКормаПодопечными.Добавить();
		Движение.Период = Дата;
		Движение.Кошка = ТекСтрокаРасходники.Кошка;
		Движение.НомерПриемаПищи = ТекСтрокаРасходники.НомерПриемаПищи;
		Движение.Получен = Истина;
		Движение.РационКормления = ТекСтрокаРасходники.РационКормления;
	КонецЦикла;

	// регистр ОстаткиРасходников Расход
	Движения.ОстаткиРасходников.Записывать = Истина;
	Для Каждого ТекСтрокаРасходники Из Расходники Цикл
		Движение = Движения.ОстаткиРасходников.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
		Движение.Период = Дата;
		Движение.Расходник = ТекСтрокаРасходники.Расходник;
		Движение.Количество = ТекСтрокаРасходники.КоличествоНаПорцию;
	КонецЦикла;

КонецПроцедуры
