
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	//{{_КОНСТРУКТОР_ПЕЧАТИ(ПечатьАнкеты)
	ТабДок = Новый ТабличныйДокумент;
	ПечатьАнкеты(ТабДок, ПараметрКоманды);

	ТабДок.ОтображатьСетку = Ложь;
	ТабДок.Защита = Ложь;
	ТабДок.ТолькоПросмотр = Ложь;
	ТабДок.ОтображатьЗаголовки = Ложь;
	ТабДок.Показать();
	//}}
КонецПроцедуры

&НаСервере
Процедура ПечатьАнкеты(ТабДок, ПараметрКоманды)
	Документы.Собеседование.ПечатьАнкеты(ТабДок, ПараметрКоманды);
КонецПроцедуры
