
&НаКлиенте
Асинх Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)

	ПараметрыДиалога = Новый ПараметрыДиалогаПомещенияФайлов;
	ПараметрыДиалога.Фильтр = "Файл изображения JPG, JPEG, PNG|*.jpg; *.jpeg; *.png"; 
	ПомещенныйФайл = Ждать ПоместитьФайлНаСерверАсинх(,,, ПараметрыДиалога);
	
	Если НЕ ПомещенныйФайл = Неопределено И НЕ ПомещенныйФайл.ПомещениеФайлаОтменено Тогда
		ЗаписатьФайлФотографииНаСервере(ПараметрКоманды, ПомещенныйФайл.Адрес, ПомещенныйФайл.СсылкаНаФайл.Имя);
		Оповестить("ОбновитьФотографииКошки", ПараметрКоманды);
	Иначе
		// Ошибка при загрузке (не отмена выбора)!!!
		ОбщегоНазначенияКлиент.СообщитьПользователю("Не удалось загрузить файл!");
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ЗаписатьФайлФотографииНаСервере(Кошка, Знач АдресВХ, Знач ИмяФайла)

	МенеджерЗаписи = РегистрыСведений.ФотографииКошек.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.Кошка = Кошка;
	МенеджерЗаписи.ИмяФайла = ИмяФайла;
	МенеджерЗаписи.ФотографияКошки = Новый ХранилищеЗначения(ПолучитьИзВременногоХранилища(АдресВХ));
	МенеджерЗаписи.Записать();

КонецПроцедуры