
&НаКлиенте
Асинх Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	//Вставить содержимое обработчика.
	//ПараметрыФормы = Новый Структура("", );
	//ОткрытьФорму("РегистрСведений.ФотографииКошек.ФормаСписка", ПараметрыФормы, ПараметрыВыполненияКоманды.Источник, ПараметрыВыполненияКоманды.Уникальность, ПараметрыВыполненияКоманды.Окно, ПараметрыВыполненияКоманды.НавигационнаяСсылка);
	
	ПараметрыДиалога = Новый ПараметрыДиалогаПомещенияФайлов;
	ПараметрыДиалога.Фильтр = "Файл изображения|*.jpg;*.png"; 
	ПомещенныйФайл = Ждать ПоместитьФайлНаСерверАсинх(,,, ПараметрыДиалога);
	
	Если ПомещенныйФайл <> Неопределено И Не ПомещенныйФайл.ПомещениеФайлаОтменено Тогда
		ЗаписатьФайлФотографииНаСервере(ПараметрКоманды, ПомещенныйФайл.Адрес, ПомещенныйФайл.СсылкаНаФайл.Имя);
	КонецЕсли;
	
	Оповестить("Добавлена картинка", ПараметрКоманды);
	
КонецПроцедуры

&НаСервере
Процедура ЗаписатьФайлФотографииНаСервере(Кошка, Знач АдресВХ, Знач ИмяФайла)

	МенеджерЗаписи = РегистрыСведений.ФотографииКошек.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.Кошка = Кошка;
	МенеджерЗаписи.ИмяФайла = ИмяФайла;
	МенеджерЗаписи.ФотографияКошки = Новый ХранилищеЗначения(ПолучитьИзВременногоХранилища(АдресВХ));
	МенеджерЗаписи.Записать();
	
КонецПроцедуры