
Процедура ОбработкаПроведения(Отказ, Режим)

	// регистр ОстаткиРасходников Приход
	Движения.ОстаткиРасходников.Записывать = Истина;
	Для Каждого ТекСтрокаРасходники Из Расходники Цикл
		Движение = Движения.ОстаткиРасходников.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период = Дата;
		Движение.Расходник = ТекСтрокаРасходники.Расходник;
		Движение.Количество = ТекСтрокаРасходники.Количество;
	КонецЦикла;

	// регистр ОстаткиРасходников Расход
	Движения.ОстаткиРасходников.Записывать = Истина;
	Для Каждого ТекСтрокаРасходники Из Расходники Цикл
		Движение = Движения.ОстаткиРасходников.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
		Движение.Период = Дата;
		Движение.Расходник = ТекСтрокаРасходники.Расходник;
		Движение.Количество = ТекСтрокаРасходники.Количество;
	КонецЦикла;

КонецПроцедуры
