
Процедура ОбработкаПроведения(Отказ, Режим)

	// регистр РезультатыВзвешиваний
	Движения.РезультатыВзвешиваний.Записывать = Истина;
	Движение = Движения.РезультатыВзвешиваний.Добавить();
	Движение.Период = Дата;
	Движение.Кошка = Кошка;
	Движение.Вес = Вес;

	// регистр РационыКормленияПодопечных
	Движения.РационыКормленияПодопечных.Записывать = Истина;
	Движение = Движения.РационыКормленияПодопечных.Добавить();
	Движение.Период = Дата;
	Движение.Кошка = Кошка;
	Движение.РационКормления = РационКормления;

КонецПроцедуры
