
Процедура ПечатьАнкеты(ТабДок, Ссылка) Экспорт
	
	ТабДок.Автомасштаб = Истина;
	
	Макет = Документы.Собеседование.ПолучитьМакет("ПечатьАнкеты");
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	Собеседование.Дата,
		|	Собеседование.Кошка,
		|	Собеседование.Номер,
		|	Собеседование.Ответственный,
		|	Собеседование.Укотовитель
		|ИЗ
		|	Документ.Собеседование КАК Собеседование
		|ГДЕ
		|	Собеседование.Ссылка В (&Ссылка)";
	Запрос.Параметры.Вставить("Ссылка", Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();

	ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	Шапка = Макет.ПолучитьОбласть("Шапка");
	
	ОбластиМакета = Макет.Области;
	Вопросы = Макет.ПолучитьОбласть("Вопросы");
	
	ТабДок.Очистить();

	ВставлятьРазделительСтраниц = Ложь;
	Пока Выборка.Следующий() Цикл
		Если ВставлятьРазделительСтраниц Тогда
			ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;

		ТабДок.Вывести(ОбластьЗаголовок);

		Шапка.Параметры.Заполнить(Выборка);
		ТабДок.Вывести(Шапка, Выборка.Уровень()); 
		
		ТабДок.Вывести(Вопросы);
		
		//Для Индекс = 0 По ОбластиМакета.Количество() - 1 Цикл
		//	
		//	ТекОбласть = ОбластиМакета[Индекс];
		//	ВыводимаяОбласть = Макет.ПолучитьОбласть(ТекОбласть.Имя);
		//	Если ТекОбласть.Имя <> "Шапка" Тогда
		//		ТабДок.Вывести(ВыводимаяОбласть);
		//	КонецЕсли;
		//	
		//КонецЦикла;
		
		ВставлятьРазделительСтраниц = Истина;
	КонецЦикла;

КонецПроцедуры
