
Процедура ОбработкаПроведения(Отказ, Режим)
	
		// регистр ОстаткиРасходников Расход
	Движения.ОстаткиРасходников.Записывать = Истина;
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	УборкаМестСодержанияСпискомРасходники.Расходник КАК Расходник,
		|	СУММА(УборкаМестСодержанияСпискомРасходники.Количество) КАК Количество,
		|	&Период КАК Период,
		|	&ВидДвижения КАК ВидДвижения
		|ПОМЕСТИТЬ ТЧСписокРасходников
		|ИЗ
		|	Документ.УборкаМестСодержанияСписком.Расходники КАК УборкаМестСодержанияСпискомРасходники
		|ГДЕ
		|	УборкаМестСодержанияСпискомРасходники.Ссылка = &Ссылка
		|
		|СГРУППИРОВАТЬ ПО
		|	УборкаМестСодержанияСпискомРасходники.Расходник
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Расходник
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТЧСписокРасходников.ВидДвижения КАК ВидДвижения,
		|	ТЧСписокРасходников.Количество КАК Количество,
		|	ТЧСписокРасходников.Период КАК Период,
		|	ТЧСписокРасходников.Расходник КАК Расходник
		|ИЗ
		|	ТЧСписокРасходников КАК ТЧСписокРасходников";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.УстановитьПараметр("ВидДвижения", ВидДвиженияНакопления.Расход);
	Запрос.УстановитьПараметр("Период", Дата);
	РезультатЗапроса = Запрос.Выполнить();
	
	ТаблицаДвижений = РезультатЗапроса.Выгрузить();
	
	Движения.ОстаткиРасходников.Загрузить(ТаблицаДвижений);
	
	Движения.ОстаткиРасходников.БлокироватьДляИзменения = Истина;

	Движения.Записать();
	
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ОстаткиРасходниковОстатки.Расходник КАК Расходник,
		|	ОстаткиРасходниковОстатки.Расходник.Представление КАК РасходникПредставление,
		|	ОстаткиРасходниковОстатки.КоличествоОстаток КАК КоличествоОстаток,
		|	ОстаткиРасходниковОстатки.Расходник.ЕдиницаИзмерения КАК РасходникЕдиницаИзмерения
		|ИЗ
		|	РегистрНакопления.ОстаткиРасходников.Остатки(
		|			&ДатаОстатков,
		|			Расходник В
		|				(ВЫБРАТЬ
		|					ТЧСписокРасходников.Расходник КАК Расходник
		|				ИЗ
		|					ТЧСписокРасходников КАК ТЧСписокРасходников)) КАК ОстаткиРасходниковОстатки
		|ГДЕ
		|	ОстаткиРасходниковОстатки.КоличествоОстаток < 0";
	
	Запрос.УстановитьПараметр("ДатаОстатков", Новый Граница(МоментВремени(), ВидГраницы.Включая));
	
	Результат = Запрос.Выполнить();

	Если НЕ Результат.Пустой() Тогда
		Отказ = Истина;
		
		Выборка = Результат.Выбрать();
		Пока Выборка.Следующий() Цикл
			Сообщение = Новый СообщениеПользователю;
			ТекстСообщения = СтрШаблон("Недостаточно расходников %1, не хватает: %2 %3", 
										Выборка.РасходникПредставление, -Выборка.КоличествоОстаток, Выборка.РасходникЕдиницаИзмерения);
			Сообщение.Текст = ТекстСообщения;
			Сообщение.Сообщить();
		КонецЦикла;
	КонецЕсли;
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	// регистр ГрафикУборкиМестСодержанияПодопечных
	Движения.ГрафикУборкиМестСодержанияПодопечных.Записывать = Истина;
	Для Каждого ТекСтрокаКошки Из Кошки Цикл
		Движение = Движения.ГрафикУборкиМестСодержанияПодопечных.Добавить();
		Движение.Период = Дата;
		Движение.Кошка = ТекСтрокаКошки.Кошка;
		Движение.Убрано = Истина;
	КонецЦикла;

КонецПроцедуры
