
Процедура ОбработкаПроведения(Отказ, Режим)
	
	Движения.ОстаткиРасходников.Записывать = Истина;
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СписаниеРасходниковРасходники.Расходник КАК Расходник,
		|	СУММА(СписаниеРасходниковРасходники.Количество) КАК Количество,
		|	&Период КАК Период,
		|	&ВидДвижения КАК ВидДвижения
		|ПОМЕСТИТЬ ТЧСписокРасходников
		|ИЗ
		|	Документ.СписаниеРасходников.Расходники КАК СписаниеРасходниковРасходники
		|ГДЕ
		|	СписаниеРасходниковРасходники.Ссылка = &Ссылка
		|
		|СГРУППИРОВАТЬ ПО
		|	СписаниеРасходниковРасходники.Расходник
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Расходник
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТЧСписокРасходников.ВидДвижения КАК ВидДвижения,
		|	ТЧСписокРасходников.Количество КАК Количество,
		|	ТЧСписокРасходников.Период КАК Период,
		|	ТЧСписокРасходников.Расходник КАК Расходник
		|ИЗ
		|	ТЧСписокРасходников КАК ТЧСписокРасходников";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.УстановитьПараметр("ВидДвижения", ВидДвиженияНакопления.Расход);
	Запрос.УстановитьПараметр("Период", Дата);
	РезультатЗапроса = Запрос.Выполнить();
	
	ТаблицаДвижений = РезультатЗапроса.Выгрузить();
	
	Движения.ОстаткиРасходников.Загрузить(ТаблицаДвижений);
	
	Движения.ОстаткиРасходников.БлокироватьДляИзменения = Истина;

	Движения.Записать();
	
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ОстаткиРасходниковОстатки.Расходник КАК Расходник,
		|	ОстаткиРасходниковОстатки.Расходник.Представление КАК РасходникПредставление,
		|	ОстаткиРасходниковОстатки.КоличествоОстаток КАК КоличествоОстаток
		|ИЗ
		|	РегистрНакопления.ОстаткиРасходников.Остатки(
		|			&ДатаОстатков,
		|			Расходник В
		|				(ВЫБРАТЬ
		|					ТЧСписокРасходников.Расходник КАК Расходник
		|				ИЗ
		|					ТЧСписокРасходников КАК ТЧСписокРасходников)) КАК ОстаткиРасходниковОстатки
		|ГДЕ
		|	ОстаткиРасходниковОстатки.КоличествоОстаток < 0";
	
	Запрос.УстановитьПараметр("ДатаОстатков", Новый Граница(МоментВремени(), ВидГраницы.Включая));
	
	Результат = Запрос.Выполнить();

	Если НЕ Результат.Пустой() Тогда
		Отказ = Истина;
		
		Выборка = Результат.Выбрать();
		Пока Выборка.Следующий() Цикл
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = "Недостаточно расходников " + Выборка.РасходникПредставление + ", не хватает: " + (-Выборка.КоличествоОстаток);
			Сообщение.Сообщить();
		КонецЦикла;
	КонецЕсли;
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры
