
//&НаКлиенте
//Процедура АдресЭлектроннойПочтыОрганизацииПриИзменении(Элемент)
//	
//	АдресЭПКоррректен = ОбщегоНазначенияКлиентСервер.АдресЭлектроннойПочтыСоответствуетТребованиям(НаборКонстант.АдресЭлектроннойПочтыОрганизации);
//	Если НЕ АдресЭПКоррректен Тогда
//		 ОбщегоНазначенияКлиент.СообщитьПользователю("Некорректный адрес ЭП!", , "АдресЭлектроннойПочтыОрганизации");
//	КонецЕсли;
//	 
//КонецПроцедуры


&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	АдресЭПКоррректен = ОбщегоНазначенияКлиентСервер.АдресЭлектроннойПочтыСоответствуетТребованиям(НаборКонстант.АдресЭлектроннойПочтыОрганизации);
	Если НЕ АдресЭПКоррректен Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю("Некорректный адрес ЭП!", , "АдресЭлектроннойПочтыОрганизации");
		Отказ = Истина;
	КонецЕсли;
	
КонецПроцедуры

