#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Объект.Ответственный = Пользователи.АвторизованныйПользователь();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура КомнатаПриИзменении(Элемент)
	ЗаполнитьГрафикКормленияПоКомнате(Объект.Комната);
	ЗаполнитьГрафикУборкиПоКомнате(Объект.Комната);
КонецПроцедуры

&НаКлиенте
Процедура СкрытьПокормленныхПриИзменении(Элемент)
	
	Если СкрытьПокормленных Тогда
		СтруктураПоиска = Новый Структура;
		СтруктураПоиска.Вставить("Покормлен", Ложь);
		Элементы.ГрафикКормления.ОтборСтрок = Новый ФиксированнаяСтруктура(СтруктураПоиска);
	Иначе
		Элементы.ГрафикКормления.ОтборСтрок = Неопределено;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СкрытьУбранныхПриИзменении(Элемент)
	
	Если СкрытьУбранных Тогда
		СтруктураПоиска = Новый Структура;
		СтруктураПоиска.Вставить("Убрано", Ложь);
		Элементы.ГрафикУборки.ОтборСтрок = Новый ФиксированнаяСтруктура(СтруктураПоиска);
	Иначе
		Элементы.ГрафикУборки.ОтборСтрок = Неопределено;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыРасходникиНаУборку

&НаКлиенте
Процедура РасходникиНаУборкуРасходникПриИзменении(Элемент)
	ТекущиеДанные = Элементы.РасходникиНаУборку.ТекущиеДанные;
	ТекущиеДанные.ЕдиницаИзмерения = 
		РаботаСРасходникамиВызовСервера.ЕдиницаИзмеренияРасходника(ТекущиеДанные.Расходник);
КонецПроцедуры
	
#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ВыдачаКормаСписком(Команда)
	ВыдачаКормаСпискомНаСервере();
КонецПроцедуры

&НаСервере
Процедура ВыдачаКормаСпискомНаСервере()
	
	ОтмеченныеСтроки = Объект.ГрафикКормления.НайтиСтроки(Новый Структура("Покормлен", Истина));
	Если НЕ ОтмеченныеСтроки.Количество() > 0 Тогда
		ОбщегоНазначения.СообщитьПользователю("Не выделена ни одна строка!");
		Возврат;
	КонецЕсли;
	
	ВыдачаКорма = Документы.ВыдачаКормаСписком.СоздатьДокумент();
	ВыдачаКорма.Дата          = ТекущаяДатаСеанса();
	ВыдачаКорма.Ответственный = Объект.Ответственный;
	
	КоличествоПорцийКормаДокументе = 0;
	
	Для Каждого Строка Из ОтмеченныеСтроки Цикл
		Если ЗначениеЗаполнено(Строка.Регистратор) Тогда
			Продолжить;
		КонецЕсли;
		
		Если НЕ (ЗначениеЗаполнено(Строка.НомерПриемаПищи) 
					И ЗначениеЗаполнено(Строка.Расходник)
					И ЗначениеЗаполнено(Строка.КоличествоНаПорцию)) Тогда
			ТекстОшибки = СтрШаблон("Заполните № приема пищи, расходник и кол-во на порцию для подопечного %1!", Строка.Кошка);
			ОбщегоНазначения.СообщитьПользователю(ТекстОшибки);
			Продолжить;
		КонецЕсли;
		НоваяСтрокаДокумента = ВыдачаКорма.Расходники.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрокаДокумента, Строка);
		КоличествоПорцийКормаДокументе = КоличествоПорцийКормаДокументе + 1;
	КонецЦикла;
	
	ВыдачаКорма.Записать(РежимЗаписиДокумента.Проведение);
	
	Если КоличествоПорцийКормаДокументе = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ТекстСообщения = СтрШаблон("Проведен документ на выдачу корма кошкам! Выдано порций: %1", КоличествоПорцийКормаДокументе);
	ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
	
	ЗаполнитьГрафикКормленияПоКомнате(Объект.Комната);
	
КонецПроцедуры

&НаКлиенте
Процедура УборкаСписком(Команда)
	УборкаСпискомНаСервере();
КонецПроцедуры

&НаСервере
Процедура УборкаСпискомНаСервере()
	
	ОтмеченныеСтроки = Объект.ГрафикУборки.НайтиСтроки(Новый Структура("Убрано", Истина));
	Если НЕ ОтмеченныеСтроки.Количество() > 0 Тогда
		ОбщегоНазначения.СообщитьПользователю("Не выделена ни одна строка!");
		Возврат;
	КонецЕсли;
	
	Уборка = Документы.УборкаМестСодержанияСписком.СоздатьДокумент();
	Уборка.Дата          = ТекущаяДатаСеанса();
	Уборка.Ответственный = Объект.Ответственный;
	
	КоличествоКошекВДокументе = 0;
	
	Для Каждого Строка Из ОтмеченныеСтроки Цикл
		Если ЗначениеЗаполнено(Строка.Регистратор) Тогда
			Продолжить;
		КонецЕсли;
		
		НоваяСтрокаДокумента = Уборка.Кошки.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрокаДокумента, Строка);	
		КоличествоКошекВДокументе = КоличествоКошекВДокументе + 1;
	КонецЦикла;
	
	Для Каждого Расходник Из Объект.РасходникиНаУборку Цикл
		НоваяСтрокаДокумента = Уборка.Расходники.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрокаДокумента, Расходник);
	КонецЦикла;
	
	Уборка.Записать(РежимЗаписиДокумента.Проведение); 
	
	Если КоличествоКошекВДокументе = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ТекстСообщения = СтрШаблон("Проведен документ на уборку у %1 кошек!", КоличествоКошекВДокументе);
	ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
	
	Объект.РасходникиНаУборку.Очистить();
	
	ЗаполнитьГрафикУборкиПоКомнате(Объект.Комната);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ЗаполнитьГрафикКормленияПоКомнате(Комната)
	
	Объект.ГрафикКормления.Очистить();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СтатусыМестаСодержанияЖивотныхСрезПоследних.Кошка КАК Кошка,
		|	СтатусыМестаСодержанияЖивотныхСрезПоследних.Статус КАК Статус,
		|	СтатусыМестаСодержанияЖивотныхСрезПоследних.МестоСодержания КАК МестоСодержания
		|ПОМЕСТИТЬ ВТ_КошкиВПриюте
		|ИЗ
		|	РегистрСведений.СтатусыМестаСодержанияЖивотных.СрезПоследних(&ДатаКормления, ) КАК СтатусыМестаСодержанияЖивотныхСрезПоследних
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_КошкиВПриюте.Кошка КАК Кошка,
		|	ВТ_КошкиВПриюте.МестоСодержания КАК МестоСодержания,
		|	РационыКормленияПодопечныхСрезПоследних.РационКормления КАК РационКормления
		|ПОМЕСТИТЬ ВТ_КошкиВПриютеСРационами
		|ИЗ
		|	ВТ_КошкиВПриюте КАК ВТ_КошкиВПриюте
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РационыКормленияПодопечных.СрезПоследних(&ДатаКормления, ) КАК РационыКормленияПодопечныхСрезПоследних
		|		ПО ВТ_КошкиВПриюте.Кошка = РационыКормленияПодопечныхСрезПоследних.Кошка
		|ГДЕ
		|	ВТ_КошкиВПриюте.МестоСодержания = &Комната
		|	И НЕ ВТ_КошкиВПриюте.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыПребыванияЖивотных.Укотовлен)
		|	И НЕ ВТ_КошкиВПриюте.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыПребыванияЖивотных.Мертв)
		|	И НЕ ВТ_КошкиВПриюте.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыПребыванияЖивотных.НаЛеченииВетклиника)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_КошкиВПриютеСРационами.Кошка КАК Кошка,
		|	ВТ_КошкиВПриютеСРационами.МестоСодержания КАК МестоСодержания,
		|	ВТ_КошкиВПриютеСРационами.РационКормления КАК РационКормления,
		|	РационКормленияСоставРациона.Расходник КАК Расходник,
		|	РационКормленияСоставРациона.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
		|	РационКормленияСоставРациона.КоличествоНаПорцию КАК КоличествоНаПорцию,
		|	РационКормленияСоставРациона.ВремяВыдачи КАК ВремяВыдачи,
		|	РационКормленияСоставРациона.НомерПриемаПищи КАК НомерПриемаПищи
		|ПОМЕСТИТЬ ВТ_ВсеОКормлении
		|ИЗ
		|	ВТ_КошкиВПриютеСРационами КАК ВТ_КошкиВПриютеСРационами
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.РационКормления.СоставРациона КАК РационКормленияСоставРациона
		|		ПО ВТ_КошкиВПриютеСРационами.РационКормления = РационКормленияСоставРациона.Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_ВсеОКормлении.Кошка КАК Кошка,
		|	ВТ_ВсеОКормлении.МестоСодержания КАК МестоСодержания,
		|	ВТ_ВсеОКормлении.РационКормления КАК РационКормления,
		|	ВТ_ВсеОКормлении.Расходник КАК Расходник,
		|	ВТ_ВсеОКормлении.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
		|	ВТ_ВсеОКормлении.КоличествоНаПорцию КАК КоличествоНаПорцию,
		|	ВТ_ВсеОКормлении.ВремяВыдачи КАК ВремяВыдачи,
		|	ВТ_ВсеОКормлении.НомерПриемаПищи КАК НомерПриемаПищи,
		|	ЕСТЬNULL(ГрафикПолученияКормаПодопечными.Получен, ЛОЖЬ) КАК Покормлен,
		|	ЕСТЬNULL(ГрафикПолученияКормаПодопечными.Регистратор, ЗНАЧЕНИЕ(Документ.ВыдачаКормаСписком.ПустаяСсылка)) КАК Регистратор
		|ИЗ
		|	ВТ_ВсеОКормлении КАК ВТ_ВсеОКормлении
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ГрафикПолученияКормаПодопечными КАК ГрафикПолученияКормаПодопечными
		|		ПО ВТ_ВсеОКормлении.Кошка = ГрафикПолученияКормаПодопечными.Кошка
		|			И ВТ_ВсеОКормлении.НомерПриемаПищи = ГрафикПолученияКормаПодопечными.НомерПриемаПищи
		|			И (ГрафикПолученияКормаПодопечными.Период МЕЖДУ НАЧАЛОПЕРИОДА(&ДатаКормления, ДЕНЬ) И КОНЕЦПЕРИОДА(&ДатаКормления, ДЕНЬ))
		|
		|УПОРЯДОЧИТЬ ПО
		|	ВремяВыдачи,
		|	НомерПриемаПищи";
	
	Запрос.УстановитьПараметр("ДатаКормления", ТекущаяДатаСеанса());
	Запрос.УстановитьПараметр("Комната", Комната);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ТаблицаКормления = РезультатЗапроса.Выгрузить();
	
	Объект.ГрафикКормления.Загрузить(ТаблицаКормления);

КонецПроцедуры

&НаСервере
Процедура ЗаполнитьГрафикУборкиПоКомнате(Комната)
	
	Объект.ГрафикУборки.Очистить();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СтатусыМестаСодержанияЖивотныхСрезПоследних.МестоСодержания КАК МестоСодержания,
		|	СтатусыМестаСодержанияЖивотныхСрезПоследних.Кошка КАК Кошка
		|ПОМЕСТИТЬ ВТ_КошкиПоМестамСодержания
		|ИЗ
		|	РегистрСведений.СтатусыМестаСодержанияЖивотных.СрезПоследних(
		|			&ДатаУборки,
		|			НЕ Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыПребыванияЖивотных.Укотовлен)
		|				И НЕ Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыПребыванияЖивотных.Мертв)
		|				И НЕ Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыПребыванияЖивотных.НаЛеченииВетклиника)) КАК СтатусыМестаСодержанияЖивотныхСрезПоследних
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	МАКСИМУМ(ГрафикУборкиМестСодержанияПодопечных.Период) КАК Период,
		|	ГрафикУборкиМестСодержанияПодопечных.Регистратор КАК Регистратор,
		|	ГрафикУборкиМестСодержанияПодопечных.Убрано КАК Убрано,
		|	ГрафикУборкиМестСодержанияПодопечных.Кошка КАК Кошка
		|ПОМЕСТИТЬ ВТ_УборкиНаДату
		|ИЗ
		|	РегистрСведений.ГрафикУборкиМестСодержанияПодопечных КАК ГрафикУборкиМестСодержанияПодопечных
		|ГДЕ
		|	ГрафикУборкиМестСодержанияПодопечных.Период МЕЖДУ НАЧАЛОПЕРИОДА(&ДатаУборки, ДЕНЬ) И КОНЕЦПЕРИОДА(&ДатаУборки, ДЕНЬ)
		|
		|СГРУППИРОВАТЬ ПО
		|	ГрафикУборкиМестСодержанияПодопечных.Кошка,
		|	ГрафикУборкиМестСодержанияПодопечных.Убрано,
		|	ГрафикУборкиМестСодержанияПодопечных.Регистратор
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_КошкиПоМестамСодержания.МестоСодержания КАК МестоСодержания,
		|	ВТ_КошкиПоМестамСодержания.Кошка КАК Кошка,
		|	ЕСТЬNULL(ВТ_УборкиНаДату.Убрано, ЛОЖЬ) КАК Убрано,
		|	ЕСТЬNULL(ВТ_УборкиНаДату.Регистратор, ЗНАЧЕНИЕ(Документ.УборкаМестаСодержания.ПустаяСсылка)) КАК Регистратор
		|ИЗ
		|	ВТ_КошкиПоМестамСодержания КАК ВТ_КошкиПоМестамСодержания
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_УборкиНаДату КАК ВТ_УборкиНаДату
		|		ПО ВТ_КошкиПоМестамСодержания.Кошка = ВТ_УборкиНаДату.Кошка
		|ГДЕ
		|	ВТ_КошкиПоМестамСодержания.МестоСодержания = &Комната";
	
	Запрос.УстановитьПараметр("ДатаУборки", ТекущаяДатаСеанса());
	Запрос.УстановитьПараметр("Комната", Комната);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ТаблицаУборки = РезультатЗапроса.Выгрузить();
	
	Объект.ГрафикУборки.Загрузить(ТаблицаУборки);
	
КонецПроцедуры

#КонецОбласти