
&НаСервере
Процедура ЗаполнитьГрафикКормленияПоКомнате(Комната)
	
	Объект.ГрафикКормления.Очистить();
	
	Запрос = Новый Запрос;
	ТекстЗапроса = 
		"ВЫБРАТЬ
		|	СтатусыМестаСодержанияЖивотныхСрезПоследних.Кошка КАК Кошка,
		|	СтатусыМестаСодержанияЖивотныхСрезПоследних.МестоСодержания КАК МестоСодержания
		|ПОМЕСТИТЬ ВТ_КошкиВПриюте
		|ИЗ
		|	РегистрСведений.СтатусыМестаСодержанияЖивотных.СрезПоследних(
		|			&ДатаКормления,
		|			НЕ Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыПребыванияЖивотных.Укотовлен)
		|				И НЕ Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыПребыванияЖивотных.Мертв)
		|				И НЕ Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыПребыванияЖивотных.НаЛеченииВетклиника)) КАК СтатусыМестаСодержанияЖивотныхСрезПоследних
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_КошкиВПриюте.Кошка КАК Кошка,
		|	ВТ_КошкиВПриюте.МестоСодержания КАК МестоСодержания,
		|	РационыКормленияПодопечныхСрезПоследних.РационКормления КАК РационКормления
		|ПОМЕСТИТЬ ВТ_КошкиВПриютеСРационами
		|ИЗ
		|	ВТ_КошкиВПриюте КАК ВТ_КошкиВПриюте
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РационыКормленияПодопечных.СрезПоследних(&ДатаКормления, ) КАК РационыКормленияПодопечныхСрезПоследних
		|		ПО ВТ_КошкиВПриюте.Кошка = РационыКормленияПодопечныхСрезПоследних.Кошка
		|ГДЕ
		|	ВТ_КошкиВПриюте.МестоСодержания = &Комната
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_КошкиВПриютеСРационами.Кошка КАК Кошка,
		|	ВТ_КошкиВПриютеСРационами.МестоСодержания КАК МестоСодержания,
		|	ВТ_КошкиВПриютеСРационами.РационКормления КАК РационКормления,
		|	РационКормленияСоставРациона.Расходник КАК Расходник,
		|	РационКормленияСоставРациона.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
		|	РационКормленияСоставРациона.КоличествоНаПорцию КАК КоличествоНаПорцию,
		|	РационКормленияСоставРациона.ВремяВыдачи КАК ВремяВыдачи,
		|	РационКормленияСоставРациона.НомерПриемаПищи КАК НомерПриемаПищи
		|ПОМЕСТИТЬ ВТ_ВсеОКормлении
		|ИЗ
		|	ВТ_КошкиВПриютеСРационами КАК ВТ_КошкиВПриютеСРационами
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.РационКормления.СоставРациона КАК РационКормленияСоставРациона
		|		ПО ВТ_КошкиВПриютеСРационами.РационКормления = РационКормленияСоставРациона.Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_ВсеОКормлении.Кошка КАК Кошка,
		|	ВТ_ВсеОКормлении.МестоСодержания КАК МестоСодержания,
		|	ВТ_ВсеОКормлении.РационКормления КАК РационКормления,
		|	ВТ_ВсеОКормлении.Расходник КАК Расходник,
		|	ВТ_ВсеОКормлении.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
		|	ВТ_ВсеОКормлении.КоличествоНаПорцию КАК КоличествоНаПорцию,
		|	ВТ_ВсеОКормлении.ВремяВыдачи КАК ВремяВыдачи,
		|	ВТ_ВсеОКормлении.НомерПриемаПищи КАК НомерПриемаПищи,
		|	ЕСТЬNULL(ГрафикПолученияКормаПодопечными.Получен, ЛОЖЬ) КАК Покормлен,
		|	ЕСТЬNULL(ГрафикПолученияКормаПодопечными.Регистратор, ЗНАЧЕНИЕ(Документ.ВыдачаКормаСписком.ПустаяСсылка)) КАК Регистратор
		|ИЗ
		|	ВТ_ВсеОКормлении КАК ВТ_ВсеОКормлении
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ГрафикПолученияКормаПодопечными КАК ГрафикПолученияКормаПодопечными
		|		ПО ВТ_ВсеОКормлении.Кошка = ГрафикПолученияКормаПодопечными.Кошка
		|			И ВТ_ВсеОКормлении.НомерПриемаПищи = ГрафикПолученияКормаПодопечными.НомерПриемаПищи
		|			И (ГрафикПолученияКормаПодопечными.Период МЕЖДУ НАЧАЛОПЕРИОДА(&ДатаКормления, ДЕНЬ) И КОНЕЦПЕРИОДА(&ДатаКормления, ДЕНЬ))";
		//|ГДЕ
		//|	НЕ ЕСТЬNULL(ГрафикПолученияКормаПодопечными.Получен, ЛОЖЬ)";
	
	Запрос.УстановитьПараметр("ДатаКормления", ТекущаяДатаСеанса());
	Запрос.УстановитьПараметр("Комната", Комната);
	
	//Если НЕ СкрытьПокормленных Тогда
	//	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "НЕ ЕСТЬNULL(ГрафикПолученияКормаПодопечными.Получен, ЛОЖЬ)", "ИСТИНА");
	//КонецЕсли;
	Запрос.Текст = ТекстЗапроса;
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ТаблицаКормления = РезультатЗапроса.Выгрузить();
	
	Объект.ГрафикКормления.Загрузить(ТаблицаКормления);

КонецПроцедуры

&НаСервере
Процедура ЗаполнитьГрафикУборкиПоКомнате(Комната)
	
	Объект.ГрафикУборки.Очистить();
	
	Запрос = Новый Запрос;
	ТекстЗапроса = 
		"ВЫБРАТЬ
		|	СтатусыМестаСодержанияЖивотныхСрезПоследних.МестоСодержания КАК МестоСодержания,
		|	СтатусыМестаСодержанияЖивотныхСрезПоследних.Кошка КАК Кошка
		|ПОМЕСТИТЬ ВТ_КошкиПоМестамСодержания
		|ИЗ
		|	РегистрСведений.СтатусыМестаСодержанияЖивотных.СрезПоследних(
		|			&ДатаУборки,
		|			НЕ Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыПребыванияЖивотных.Укотовлен)
		|				И НЕ Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыПребыванияЖивотных.Мертв)
		|				И НЕ Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыПребыванияЖивотных.НаЛеченииВетклиника)) КАК СтатусыМестаСодержанияЖивотныхСрезПоследних
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	МАКСИМУМ(ГрафикУборкиМестСодержанияПодопечных.Период) КАК Период,
		|	ГрафикУборкиМестСодержанияПодопечных.Регистратор КАК Регистратор,
		|	ГрафикУборкиМестСодержанияПодопечных.Убрано КАК Убрано,
		|	ГрафикУборкиМестСодержанияПодопечных.Кошка КАК Кошка
		|ПОМЕСТИТЬ ВТ_УборкиНаДату
		|ИЗ
		|	РегистрСведений.ГрафикУборкиМестСодержанияПодопечных КАК ГрафикУборкиМестСодержанияПодопечных
		|ГДЕ
		|	ГрафикУборкиМестСодержанияПодопечных.Период МЕЖДУ НАЧАЛОПЕРИОДА(&ДатаУборки, ДЕНЬ) И КОНЕЦПЕРИОДА(&ДатаУборки, ДЕНЬ)
		|
		|СГРУППИРОВАТЬ ПО
		|	ГрафикУборкиМестСодержанияПодопечных.Кошка,
		|	ГрафикУборкиМестСодержанияПодопечных.Убрано,
		|	ГрафикУборкиМестСодержанияПодопечных.Регистратор
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_КошкиПоМестамСодержания.МестоСодержания КАК МестоСодержания,
		|	ВТ_КошкиПоМестамСодержания.Кошка КАК Кошка,
		|	ЕСТЬNULL(ВТ_УборкиНаДату.Убрано, ЛОЖЬ) КАК Убрано,
		|	ЕСТЬNULL(ВТ_УборкиНаДату.Регистратор, ЗНАЧЕНИЕ(Документ.УборкаМестаСодержания.ПустаяСсылка)) КАК Регистратор
		|ИЗ
		|	ВТ_КошкиПоМестамСодержания КАК ВТ_КошкиПоМестамСодержания
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_УборкиНаДату КАК ВТ_УборкиНаДату
		|		ПО ВТ_КошкиПоМестамСодержания.Кошка = ВТ_УборкиНаДату.Кошка
		|ГДЕ
		|	ВТ_КошкиПоМестамСодержания.МестоСодержания = &Комната";
		//|	И НЕ ЕСТЬNULL(ВТ_УборкиНаДату.Убрано, ЛОЖЬ)";
	
	Запрос.УстановитьПараметр("ДатаУборки", ТекущаяДатаСеанса());
	Запрос.УстановитьПараметр("Комната", Комната);
	
	//Если НЕ СкрытьУбранных Тогда
	//	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "И НЕ ЕСТЬNULL(ВТ_УборкиНаДату.Убрано, ЛОЖЬ)", "");
	//КонецЕсли;
	Запрос.Текст = ТекстЗапроса;
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ТаблицаУборки = РезультатЗапроса.Выгрузить();
	
	Объект.ГрафикУборки.Загрузить(ТаблицаУборки);
	
КонецПроцедуры

&НаКлиенте
Процедура КомнатаПриИзменении(Элемент)
	ЗаполнитьГрафикКормленияПоКомнате(Объект.Комната);
	ЗаполнитьГрафикУборкиПоКомнате(Объект.Комната);
КонецПроцедуры

&НаКлиенте
Процедура ВыдачаКормаСписком(Команда)
	ВыдачаКормаСпискомНаСервере();
КонецПроцедуры

&НаСервере
Процедура ВыдачаКормаСпискомНаСервере()
	
	ОтмеченныеСтроки = Объект.ГрафикКормления.НайтиСтроки(Новый Структура("Покормлен", Истина));
	Если НЕ ОтмеченныеСтроки.Количество() > 0 Тогда
		ОбщегоНазначения.СообщитьПользователю("Не выделена ни одна кошка!");
		Возврат;
	КонецЕсли;
	
	ВыдачаКорма = Документы.ВыдачаКормаСписком.СоздатьДокумент();
	ВыдачаКорма.Дата          = ТекущаяДатаСеанса();
	ВыдачаКорма.Ответственный = Объект.Ответственный;
	
	Для Каждого Строка Из ОтмеченныеСтроки Цикл
		НоваяСтрокаДокумента = ВыдачаКорма.Расходники.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрокаДокумента, Строка);
	КонецЦикла;
	
	ВыдачаКорма.Записать(РежимЗаписиДокумента.Проведение);
	
	ТекстСообщения = СтрШаблон("Проведен документ на выдачу корма %1 кошкам", ОтмеченныеСтроки.Количество());
	ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
	
	ЗаполнитьГрафикКормленияПоКомнате(Объект.Комната);
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Объект.Ответственный = Пользователи.АвторизованныйПользователь();
	
КонецПроцедуры

&НаКлиенте
Процедура СкрытьПокормленныхПриИзменении(Элемент)
	
	ЗаполнитьГрафикКормленияПоКомнате(Объект.Комната);
	
КонецПроцедуры

&НаКлиенте
Процедура СкрытьУбранныхПриИзменении(Элемент)
	
	ЗаполнитьГрафикУборкиПоКомнате(Объект.Комната);
	
КонецПроцедуры

&НаКлиенте
Процедура УборкаСписком(Команда)
	УборкаСпискомНаСервере();
КонецПроцедуры

&НаСервере
Процедура УборкаСпискомНаСервере()
	
	ОтмеченныеСтроки = Объект.ГрафикУборки.НайтиСтроки(Новый Структура("Убрано", Истина));
	Если НЕ ОтмеченныеСтроки.Количество() > 0 Тогда
		ОбщегоНазначения.СообщитьПользователю("Не выделена ни одна кошка!");
		Возврат;
	КонецЕсли;
	
	Уборка = Документы.УборкаМестСодержанияСписком.СоздатьДокумент();
	Уборка.Дата          = ТекущаяДатаСеанса();
	Уборка.Ответственный = Объект.Ответственный;
	
	Для Каждого Строка Из ОтмеченныеСтроки Цикл
		НоваяСтрокаДокумента = Уборка.Кошки.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрокаДокумента, Строка);
	КонецЦикла;
	
	Для Каждого Расходник Из Объект.РасходникиНаУборку Цикл
		НоваяСтрокаДокумента = Уборка.Расходники.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрокаДокумента, Расходник);
	КонецЦикла;
	
	Уборка.Записать(РежимЗаписиДокумента.Проведение);
	
	ТекстСообщения = СтрШаблон("Проведен документ на уборку у %1 кошек", ОтмеченныеСтроки.Количество());
	ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
	
	Объект.РасходникиНаУборку.Очистить();
	
	ЗаполнитьГрафикУборкиПоКомнате(Объект.Комната);
	
КонецПроцедуры

&НаКлиенте
Процедура РасходникиНаУборкуРасходникПриИзменении(Элемент)

	ТекущиеДанные = Элементы.РасходникиНаУборку.ТекущиеДанные;
	ТекущиеДанные.ЕдиницаИзмерения = 
		РаботаСРасходникамиВызовСервера.ЕдиницаИзмеренияРасходника(ТекущиеДанные.Расходник);
		
КонецПроцедуры
