
&НаКлиенте
Процедура ФамилияПриИзменении(Элемент)
	
	ОбновитьФИО();
	
КонецПроцедуры

&НаКлиенте
Процедура ИмяПриИзменении(Элемент)
	
	ОбновитьФИО();
	
КонецПроцедуры


&НаКлиенте
Процедура ОтчествоПриИзменении(Элемент)
	
	ОбновитьФИО();

КонецПроцедуры

&НаКлиенте
Процедура ОбновитьФИО()
	
	Объект.Наименование = СтрШаблон("%1 %2 %3", Объект.Фамилия, Объект.Имя, Объект.Отчество);
	
КонецПроцедуры

&НаКлиенте
Процедура СохранитьПаспортныеДанные(Команда)
	
	Если НЕ ЗначениеЗаполнено(ЭтаФорма.Объект.Ссылка) Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю("Запишите физ.лицо и повторите сохранение!");
	КонецЕсли;
	
	СохранитьПаспортныеДанныеНаСервере();
КонецПроцедуры

&НаСервере
Процедура СохранитьПаспортныеДанныеНаСервере()
	
	МенеджерЗаписи = РегистрыСведений.ДокументыФизическихЛиц.СоздатьМенеджерЗаписи();
	
	МенеджерЗаписи.Период = ПаспортныеДанные.Период;
	МенеджерЗаписи.ФизическоеЛицо = Объект.Ссылка;
	МенеджерЗаписи.ВидДокумента = ПаспортныеДанные.ВидДокумента;
	МенеджерЗаписи.Серия = ПаспортныеДанные.Серия;
	МенеджерЗаписи.Номер = ПаспортныеДанные.Номер;
	МенеджерЗаписи.КемВыдан = ПаспортныеДанные.КемВыдан;
	МенеджерЗаписи.ДатаВыдачи = ПаспортныеДанные.ДатаВыдачи;
	МенеджерЗаписи.КодПодразделения = ПаспортныеДанные.КодПодразделения;
	МенеджерЗаписи.СрокДействия = ПаспортныеДанные.СрокДействия;	

	МенеджерЗаписи.Записать();
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ДокументыФизическихЛицСрезПоследних.Период КАК Период,
		|	ДокументыФизическихЛицСрезПоследних.ВидДокумента КАК ВидДокумента,
		|	ДокументыФизическихЛицСрезПоследних.Серия КАК Серия,
		|	ДокументыФизическихЛицСрезПоследних.Номер КАК Номер,
		|	ДокументыФизическихЛицСрезПоследних.ДатаВыдачи КАК ДатаВыдачи,
		|	ДокументыФизическихЛицСрезПоследних.СрокДействия КАК СрокДействия,
		|	ДокументыФизическихЛицСрезПоследних.КемВыдан КАК КемВыдан,
		|	ДокументыФизическихЛицСрезПоследних.КодПодразделения КАК КодПодразделения
		|ИЗ
		|	РегистрСведений.ДокументыФизическихЛиц.СрезПоследних(&Дата, ФизическоеЛицо = &ФизическоеЛицо) КАК ДокументыФизическихЛицСрезПоследних";
	
	Запрос.УстановитьПараметр("Дата", ТекущаяДатаСеанса());
	Запрос.УстановитьПараметр("ФизическоеЛицо", Объект.Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Если Выборка.Следующий() Тогда
		ЗаполнитьЗначенияСвойств(ПаспортныеДанные, Выборка);
	КонецЕсли;
	
КонецПроцедуры
