
Процедура ОбработкаПроведения(Отказ, Режим)
	
	// регистр ЗаполненностьКомнат Приход
	Движения.ЗаполненностьКомнат.Записывать = Истина;
	Движение = Движения.ЗаполненностьКомнат.Добавить();
	Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
	Движение.Период = Дата;
	Движение.Комната = КомнатаПосле;
	Движение.КоличествоКотов = 1;	
	
	Движения.ЗаполненностьКомнат.БлокироватьДляИзменения = Истина;
	
	Движения.Записать();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЗаполненностьКомнатОстатки.Комната.Представление КАК КомнатаПредставление
		|ИЗ
		|	РегистрНакопления.ЗаполненностьКомнат.Остатки(&ДатаПеремещения, Комната.Ссылка = &Комната) КАК ЗаполненностьКомнатОстатки
		|ГДЕ
		|	ЗаполненностьКомнатОстатки.Комната.Вместимость - ЗаполненностьКомнатОстатки.КоличествоКотовОстаток < 0";
	
	Запрос.УстановитьПараметр("ДатаПеремещения", Новый Граница(МоментВремени(), ВидГраницы.Включая));
	Запрос.УстановитьПараметр("Комната", КомнатаПосле);

	Результат = Запрос.Выполнить();

	Если НЕ Результат.Пустой() Тогда
		Отказ = Истина;
		
		Выборка = Результат.Выбрать();
		Пока Выборка.Следующий() Цикл
			Сообщение = Новый СообщениеПользователю;
			ТекстСообщения = СтрШаблон("Комната %1 заполнена. Перемещение невозможно!", Выборка.КомнатаПредставление);
			Сообщение.Текст = ТекстСообщения;
			Сообщение.Сообщить();
		КонецЦикла;
	КонецЕсли;
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	// регистр ЗаполненностьКомнат Расход
	Движения.ЗаполненностьКомнат.Записывать = Истина;
	Движение = Движения.ЗаполненностьКомнат.Добавить();
	Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
	Движение.Период = Дата;
	Движение.Комната = КомнатаДо;
	Движение.КоличествоКотов = 1;
	
	НовыйСтатусКота = СтатусКотаПоКомнате(КомнатаПосле);
	
	Если НовыйСтатусКота = Перечисления.СтатусыПребыванияЖивотных.ПустаяСсылка() Тогда
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	// регистр СтатусыМестаСодержанияЖивотных
	Движения.СтатусыМестаСодержанияЖивотных.Записывать = Истина;
	Движение = Движения.СтатусыМестаСодержанияЖивотных.Добавить();
	Движение.Период = Дата;
	Движение.Кошка = Кошка;
	Движение.Статус = НовыйСтатусКота;
	Движение.МестоСодержания = КомнатаПосле;
	Движение.ПричинаПеремещения = ПричинаПеремещения;
	
КонецПроцедуры

Функция СтатусКотаПоКомнате(Комната)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СоответствиеСтатусовНазначениюКомнат.Статус КАК Статус,
		|	Комнаты.Представление КАК КомнатаПредставление
		|ИЗ
		|	Справочник.Комнаты КАК Комнаты
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СоответствиеСтатусовНазначениюКомнат КАК СоответствиеСтатусовНазначениюКомнат
		|		ПО Комнаты.Назначение = СоответствиеСтатусовНазначениюКомнат.Назначение
		|ГДЕ
		|	Комнаты.Ссылка = &Комната";
	
	Запрос.УстановитьПараметр("Комната", Комната);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	СтатусКота = Перечисления.СтатусыПребыванияЖивотных.ПустаяСсылка();
	Выборка = РезультатЗапроса.Выбрать();
	
	Если Выборка.Следующий() Тогда
		СтатусКота = Выборка.Статус;
	Иначе
		Ошибка = СтрШаблон("Для комнаты %1 не задано соответствие ее назначения статусу подопечного!", Выборка.КомнатаПредставление);
		ОбщегоНазначения.СообщитьПользователю(Ошибка);
	КонецЕсли;
	
	Возврат СтатусКота;
	
КонецФункции
