
Процедура ОбработкаПроведения(Отказ, Режим)
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СоответствиеСтатусовНазначениюКомнат.Статус КАК Статус
		|ИЗ
		|	Справочник.Комнаты КАК Комнаты
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СоответствиеСтатусовНазначениюКомнат КАК СоответствиеСтатусовНазначениюКомнат
		|		ПО Комнаты.Назначение = СоответствиеСтатусовНазначениюКомнат.Назначение
		|ГДЕ
		|	Комнаты.Ссылка = &Комната";
	
	Запрос.УстановитьПараметр("Комната", КомнатаПосле);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	СтатусКота = Перечисления.СтатусыПребыванияЖивотных.ПустаяСсылка();
	Если НЕ РезультатЗапроса.Пустой() Тогда
		Выборка = РезультатЗапроса.Выбрать();
	
		Если Выборка.Следующий() Тогда
			СтатусКота = Выборка.Статус;
		КонецЕсли;
	Иначе
		Сообщить("Не указано соответствие назначения комнаты и статуса!");
	КонецЕсли;
	
	// регистр СтатусыМестаСодержанияЖивотных
	Движения.СтатусыМестаСодержанияЖивотных.Записывать = Истина;
	Движение = Движения.СтатусыМестаСодержанияЖивотных.Добавить();
	Движение.Период = Дата;
	Движение.Кошка = Кошка;
	Движение.Статус = СтатусКота;
	Движение.МестоСодержания = КомнатаПосле;
	Движение.ПричинаПеремещения = ПричинаПеремещения;
	
	// регистр ЗаполненностьКомнат Приход
	Движения.ЗаполненностьКомнат.Записывать = Истина;
	Движение = Движения.ЗаполненностьКомнат.Добавить();
	Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
	Движение.Период = Дата;
	Движение.Комната = КомнатаПосле;
	Движение.КоличествоКотов = 1;
	
	// регистр ЗаполненностьКомнат Расход
	Движения.ЗаполненностьКомнат.Записывать = Истина;
	Движение = Движения.ЗаполненностьКомнат.Добавить();
	Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
	Движение.Период = Дата;
	Движение.Комната = КомнатаДо;
	Движение.КоличествоКотов = 1;
КонецПроцедуры
