
Процедура ОбработкаПроведения(Отказ, Режим)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СтатусыМестаСодержанияЖивотныхСрезПоследних.МестоСодержания КАК МестоСодержания
		|ИЗ
		|	РегистрСведений.СтатусыМестаСодержанияЖивотных.СрезПоследних(&Дата, Кошка = &Кошка) КАК СтатусыМестаСодержанияЖивотныхСрезПоследних";
	
	Запрос.УстановитьПараметр("Дата", Дата);
	Запрос.УстановитьПараметр("Кошка", Кошка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		Сообщить("Не удалось определить текущее место содержания кошки");
		Отказ = Истина;
	КонецЕсли;
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Если Выборка.Следующий() Тогда
		МестоСодержания = Выборка.МестоСодержания;
	КонецЕсли;
	
	//Кот может умереть в вет. клинике или у укотовителя, тогда движений нет
	Если ТипЗнч(МестоСодержания) = Тип("СправочникОбъект.Комнаты") Тогда
		// регистр ЗаполненностьКомнат Расход
		Движения.ЗаполненностьКомнат.Записывать = Истина;
		Движение = Движения.ЗаполненностьКомнат.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
		Движение.Период = Дата;
		Движение.Комната = МестоСодержания;
		Движение.КоличествоКотов = 1;
	КонецЕсли;
	
	// регистр СтатусыМестаСодержанияЖивотных
	Движения.СтатусыМестаСодержанияЖивотных.Записывать = Истина;
	Движение = Движения.СтатусыМестаСодержанияЖивотных.Добавить();
	Движение.Период = Дата;
	Движение.Кошка = Кошка;
	Движение.Статус = Перечисления.СтатусыПребыванияЖивотных.Мертв;
	Движение.ПричинаПеремещения = Справочники.ПричиныПеремещенияЖивотных.Смерть;

КонецПроцедуры
