
Процедура ОбработкаПроведения(Отказ, Режим)
	
	//Кот может умереть в вет. клинике
	//Запрос = Новый Запрос;
	//Запрос.Текст = 
	//	"ВЫБРАТЬ
	//	|	СтатусыМестаСодержанияЖивотныхСрезПервых.МестоСодержания КАК МестоСодержания
	//	|ИЗ
	//	|	РегистрСведений.СтатусыМестаСодержанияЖивотных.СрезПервых(&Дата, Кошка = &Кошка) КАК СтатусыМестаСодержанияЖивотныхСрезПервых";
	//
	//Запрос.УстановитьПараметр("Дата", Дата);
	//Запрос.УстановитьПараметр("Кошка", Кошка);
	//
	//РезультатЗапроса = Запрос.Выполнить();
	//
	//Если РезультатЗапроса.Пустой() Тогда
	//	Сообщить("Не удалось определить");
	//	Отказ = Истина;
	//КонецЕсли;
	//
	//Выборка = РезультатЗапроса.Выбрать();
	//
	//Если Выборка.Следующий() Цикл
	//	// Вставить обработку выборки ВыборкаДетальныеЗаписи
	//КонецЕсли;
	//
	////}}КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА

	//// регистр ЗаполненностьКомнат Расход
	//Движения.ЗаполненностьКомнат.Записывать = Истина;
	//Движение = Движения.ЗаполненностьКомнат.Добавить();
	//Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
	//Движение.Период = Дата;
	//Движение.Комната = "";
	//Движение.КоличествоКотов = 1;

КонецПроцедуры
