
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Ответственный = Пользователи.АвторизованныйПользователь();
КонецПроцедуры

&НаКлиенте
Процедура РасходникиРасходникПриИзменении(Элемент)
	ТекущиеДанные = Элементы.Расходники.ТекущиеДанные;
	ТекущиеДанные.ЕдиницаИзмерения = 
		РаботаСРасходникамиВызовСервера.ЕдиницаИзмеренияРасходника(ТекущиеДанные.Расходник);
КонецПроцедуры

&НаКлиенте
Процедура РасходникиКоличествоПриИзменении(Элемент)
	ОбновитьКоличествоВсего();
КонецПроцедуры

&НаКлиенте
Процедура РасходникиКоличествоВЕдиницеПриИзменении(Элемент)
	ОбновитьКоличествоВсего();
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьКоличествоВсего()
	ТекущиеДанные = Элементы.Расходники.ТекущиеДанные;
	ТекущиеДанные.КоличествоВсего = ТекущиеДанные.Количество * ТекущиеДанные.КоличествоВЕдинице;
КонецПроцедуры
