
&НаКлиенте
Процедура РасходникиКошкаПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Расходники.ТекущиеДанные;
	
	РационКормленияКошки = РационКормленияКошки(Объект.Дата, ТекущиеДанные.Кошка);
	Если РационКормленияКошки = Неопределено Тогда
		ТекстОшибки = СтрШаблон("Не установлен рацион кормления для кошки %1!", ТекущиеДанные.Кошка);
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстОшибки);
		Возврат;
	КонецЕсли;
	
	ТекущиеДанные.РационКормления = РационКормленияКошки;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция РационКормленияКошки(Дата, Кошка)
	
	РационКормления = Неопределено;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	РационыКормленияПодопечныхСрезПоследних.РационКормления КАК РационКормления
		|ИЗ
		|	РегистрСведений.РационыКормленияПодопечных.СрезПоследних(&Период, Кошка = &Кошка) КАК РационыКормленияПодопечныхСрезПоследних";
	
	Запрос.УстановитьПараметр("Период", Дата);
	Запрос.УстановитьПараметр("Кошка", Кошка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Если Выборка.Следующий() Тогда
		РационКормления = Выборка.РационКормления;
	КонецЕсли;
	
	Возврат РационКормления;
	
КонецФункции

&НаКлиенте
Процедура РасходникиНомерПриемаПищиПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Расходники.ТекущиеДанные;
	
	Если НЕ ЗначениеЗаполнено(ТекущиеДанные.РационКормления) Тогда
		Возврат;
	КонецЕсли;
	
	ДанныеПриемаПищи = ДанныеПриемаПищи(ТекущиеДанные.РационКормления, ТекущиеДанные.НомерПриемаПищи);
	
	Если НЕ ЗначениеЗаполнено(ДанныеПриемаПищи.Расходник) Тогда
		ТекстОшибки = "По № приема пищи не найдены данные в рационе!";
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстОшибки);
		Возврат;
	КонецЕсли;
	
	ТекущиеДанные.Расходник          = ДанныеПриемаПищи.Расходник;
	ТекущиеДанные.ЕдиницаИзмерения   = ДанныеПриемаПищи.ЕдиницаИзмерения;
	ТекущиеДанные.КоличествоНаПорцию = ДанныеПриемаПищи.КоличествоНаПорцию;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ДанныеПриемаПищи(РационКормления, НомерПриемаПищи)
	
	ДанныеПриемаПищи = Новый Структура("Расходник,ЕдиницаИзмерения,КоличествоНаПорцию");
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	РационКормленияСоставРациона.Расходник КАК Расходник,
		|	РационКормленияСоставРациона.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
		|	РационКормленияСоставРациона.КоличествоНаПорцию КАК КоличествоНаПорцию
		|ИЗ
		|	Справочник.РационКормления.СоставРациона КАК РационКормленияСоставРациона
		|ГДЕ
		|	РационКормленияСоставРациона.Ссылка = &Ссылка
		|	И РационКормленияСоставРациона.НомерПриемаПищи = &НомерПриемаПищи";
	
	Запрос.УстановитьПараметр("НомерПриемаПищи", НомерПриемаПищи);
	Запрос.УстановитьПараметр("Ссылка", РационКормления);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Если Выборка.Следующий() Тогда
		ДанныеПриемаПищи.Расходник          = Выборка.Расходник;
		ДанныеПриемаПищи.ЕдиницаИзмерения   = Выборка.ЕдиницаИзмерения;
		ДанныеПриемаПищи.КоличествоНаПорцию = Выборка.КоличествоНаПорцию;
	КонецЕсли;
	
	Возврат ДанныеПриемаПищи;

КонецФункции
