
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ЗаявкаНаПередачуЖивотногоВПриют") Тогда
		Опекун = ДанныеЗаполнения.Опекун;
		ДокументОснование = ДанныеЗаполнения.Ссылка;
	КонецЕсли;

КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим)

	// регистр СтатусыМестаСодержанияЖивотных
	Движения.СтатусыМестаСодержанияЖивотных.Записывать = Истина;
	Движение = Движения.СтатусыМестаСодержанияЖивотных.Добавить();
	Движение.Период = Дата;
	Движение.Кошка = Кошка;
	Движение.Статус = Перечисления.СтатусыПребыванияЖивотных.Новый;
	Движение.МестоСодержания = Справочники.Комнаты.Приемная;
	Движение.ПричинаПеремещения = Справочники.ПричиныПеремещенияЖивотных.ПриемЖивотного;
	
	// регистр ЗаполненностьКомнат Приход
	Движения.ЗаполненностьКомнат.Записывать = Истина;
	Движение = Движения.ЗаполненностьКомнат.Добавить();
	Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
	Движение.Период = Дата;
	Движение.Комната = Справочники.Комнаты.Приемная;
	Движение.КоличествоКотов = 1;

КонецПроцедуры
