
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ЗаявкаНаПередачуЖивотногоВПриют") Тогда
		Опекун = ДанныеЗаполнения.Опекун;
		ДокументОснование = ДанныеЗаполнения.Ссылка;
	КонецЕсли;

КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим)

	// регистр СтатусыПребыванияКотов
	Движения.СтатусыПребыванияКотов.Записывать = Истина;
	Движение = Движения.СтатусыПребыванияКотов.Добавить();
	Движение.Период = Дата;
	Движение.Кот = Кот;
	Движение.Статус = Перечисления.СтатусыПребыванияЖивотных.Новый;

КонецПроцедуры
