
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Объект.Мероприятие = Справочники.АдминистративныеМероприятия.ПриемЖивотного;
	
	Объект.Ответственный = Пользователи.АвторизованныйПользователь();
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ПроверитьПересечениеМероприятий(ВремяВизита)
	
	//Запрос = Новый Запрос;
	//Запрос.Текст = 
	//	"ВЫБРАТЬ
	//	|	ГрафикАдминистративныхМероприятий.ДатаНачала КАК ДатаНачала,
	//	|	ГрафикАдминистративныхМероприятий.Мероприятие КАК Мероприятие,
	//	|	ЕСТЬNULL(ПродолжительностьМероприятий.Продолжительность, ДАТАВРЕМЯ(1, 1, 1, 0, 10, 0)) КАК Продолжительность
	//	|ПОМЕСТИТЬ ВТ_МероприятияВЭтотДень
	//	|ИЗ
	//	|	РегистрСведений.ГрафикАдминистративныхМероприятий КАК ГрафикАдминистративныхМероприятий
	//	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПродолжительностьМероприятий КАК ПродолжительностьМероприятий
	//	|		ПО ГрафикАдминистративныхМероприятий.Мероприятие = ПродолжительностьМероприятий.Мероприятие
	//	|ГДЕ
	//	|	ДЕНЬ(ГрафикАдминистративныхМероприятий.ДатаНачала) = ДЕНЬ(&ДатаНачала)
	//	|;
	//	|
	//	|////////////////////////////////////////////////////////////////////////////////
	//	|ВЫБРАТЬ
	//	|	ВТ_МероприятияВЭтотДень.ДатаНачала КАК ДатаНачала,
	//	|	ВТ_МероприятияВЭтотДень.Мероприятие КАК Мероприятие,
	//	|	ВТ_МероприятияВЭтотДень.Продолжительность КАК Продолжительность
	//	|ИЗ
	//	|	ВТ_МероприятияВЭтотДень КАК ВТ_МероприятияВЭтотДень";
	//
	//Запрос.УстановитьПараметр("ДатаНачала", ВремяВизита);
	//
	//РезультатЗапроса = Запрос.Выполнить();
	//
	//ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	//
	//Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
	//	// Вставить обработку выборки ВыборкаДетальныеЗаписи
	//КонецЦикла;
	
	//}}КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА

КонецПроцедуры

&НаКлиенте
Процедура ВремяВизитаПриИзменении(Элемент)
	ПроверитьПересечениеМероприятий(Объект.ВремяВизита);
КонецПроцедуры
