
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Объект.Ответственный = Пользователи.АвторизованныйПользователь();
	
КонецПроцедуры

&НаКлиенте
Процедура КошкаПриИзменении(Элемент)
	
	КошкуМожноПеремещать = КошкуМожноПеремещать(Объект.Кошка);
	Если НЕ КошкуМожноПеремещать Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Функция КошкуМожноПеремещать(Кошка)

	КошкуМожноПеремещать = Истина;
	
	ТекущиеСтатусМестоСодержания = ТекущиеСтатусМестоСодержания(Кошка);
	
	Если ТекущиеСтатусМестоСодержания.Статус = ОбщегоНазначенияКлиент.ПредопределенныйЭлемент("Перечисление.СтатусыПребыванияЖивотных.Укотовлен") Тогда
		ТекстОшибки = СтрШаблон("Подопечный %1 укотовлен(а)! Перемещение невозможно!", Кошка);
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстОшибки);
		КошкуМожноПеремещать = Ложь;
	ИначеЕсли ТекущиеСтатусМестоСодержания.Статус = ОбщегоНазначенияКлиент.ПредопределенныйЭлемент("Перечисление.СтатусыПребыванияЖивотных.Мертв") Тогда
		ТекстОшибки = СтрШаблон("Подопечный %1 мертв(а)! Перемещение невозможно!", Кошка);
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстОшибки);
		КошкуМожноПеремещать = Ложь;
	КонецЕсли;
	
	Если ТекущиеСтатусМестоСодержания.МестоСодержания = Неопределено Тогда
		
		ОбщегоНазначенияКлиент.СообщитьПользователю("Не удалось определить текущее место содержания кошки!");
		КошкуМожноПеремещать = Ложь;
		
	ИначеЕсли ТипЗнч(ТекущиеСтатусМестоСодержания.МестоСодержания) = Тип("СправочникСсылка.Комнаты")
		И  ТекущиеСтатусМестоСодержания.Назначение = ОбщегоНазначенияКлиент.ПредопределенныйЭлемент("Справочник.НазначенияКомнат.Карантин") 
		И ТекущиеСтатусМестоСодержания.ВремениПрошло < 21 Тогда
		
		ТекстОшибки = СтрШаблон("%1/21 день карантина. Перемещение запрещено!", ТекущиеСтатусМестоСодержания.ВремениПрошло);
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстОшибки);
		
		Объект.КомнатаДо = ТекущиеСтатусМестоСодержания.МестоСодержания;
		
		КошкуМожноПеремещать = Ложь;
	Иначе
		Объект.КомнатаДо = ТекущиеСтатусМестоСодержания.МестоСодержания;
	КонецЕсли;
	
	Возврат КошкуМожноПеремещать;
	
КонецФункции

&НаСервереБезКонтекста
Функция ТекущиеСтатусМестоСодержания(Кошка)
	
	ТекущиеСтатусМестоСодержания = Новый Структура("Статус,МестоСодержания,Назначение,ВремениПрошло");
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СтатусыМестаСодержанияЖивотныхСрезПоследних.МестоСодержания КАК МестоСодержания,
		|	СтатусыМестаСодержанияЖивотныхСрезПоследних.Статус КАК Статус,
		|	СтатусыМестаСодержанияЖивотныхСрезПоследних.Период КАК Период,
		|	РАЗНОСТЬДАТ(СтатусыМестаСодержанияЖивотныхСрезПоследних.Период, &ДатаПеремещения, ДЕНЬ) КАК ВремениПрошло,
		|	СтатусыМестаСодержанияЖивотныхСрезПоследних.МестоСодержания.Назначение КАК Назначение
		|ИЗ
		|	РегистрСведений.СтатусыМестаСодержанияЖивотных.СрезПоследних(&ДатаПеремещения, Кошка = &Кошка) КАК СтатусыМестаСодержанияЖивотныхСрезПоследних";
	
	Запрос.УстановитьПараметр("ДатаПеремещения", ТекущаяДатаСеанса());
	Запрос.УстановитьПараметр("Кошка", Кошка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Если Выборка.Следующий() Тогда
		ТекущиеСтатусМестоСодержания.Статус           = Выборка.Статус;
		ТекущиеСтатусМестоСодержания.МестоСодержания  = Выборка.МестоСодержания;
		ТекущиеСтатусМестоСодержания.Назначение       = Выборка.Назначение;
		ТекущиеСтатусМестоСодержания.ВремениПрошло    = Выборка.ВремениПрошло;
	КонецЕсли;
	
	Возврат ТекущиеСтатусМестоСодержания;
	
КонецФункции

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	Если НЕ КошкуМожноПеремещать(Объект.Кошка) Тогда
		Отказ = Истина;
	КонецЕсли;
	
	Если Объект.КомнатаПосле = Объект.КомнатаДо Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю("Комната до и после перемещения совпадает!");
		Отказ = Истина;
	КонецЕсли;
	
	НазначениеКомнатыПосле = НазначениеКомнаты(Объект.КомнатаПосле);
	Если Объект.КомнатаДо = ОбщегоНазначенияКлиент.ПредопределенныйЭлемент("Справочник.Комнаты.Приемная") 
		И НЕ НазначениеКомнатыПосле = ОбщегоНазначенияКлиент.ПредопределенныйЭлемент("Справочник.НазначенияКомнат.Карантин") Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю("После Приемной обязательно перемещение в Карантин на 21 день!");
		Отказ = Истина;
	КонецЕсли;
	
КонецПроцедуры

&наСервереБезКонтекста
Функция НазначениеКомнаты(Комната)

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Комнаты.Назначение КАК Назначение
		|ИЗ
		|	Справочник.Комнаты КАК Комнаты
		|ГДЕ
		|	Комнаты.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Комната);
	
	РезультатЗапроса = Запрос.Выполнить();	
	Выборка = РезультатЗапроса.Выбрать();
	
	Если Выборка.Следующий() Тогда
		НазначениеКомнаты = Выборка.Назначение;
	КонецЕсли;
	
	Возврат НазначениеКомнаты;

КонецФункции

