
Процедура Печать(ТабДок, Ссылка) Экспорт
	
	Макет = Документы.ДоговорОтветственногоСодержания.ПолучитьМакет("Печать");
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ДоговорОтветственногоСодержания.Номер КАК Номер,
	|	ДоговорОтветственногоСодержания.Дата КАК Дата,
	|	ДоговорОтветственногоСодержания.Кошка КАК Кошка,
	|	ДоговорОтветственногоСодержания.Кошка.Порода КАК КошкаПорода,
	|	ДоговорОтветственногоСодержания.Кошка.Окрас КАК КошкаОкрас,
	|	ДоговорОтветственногоСодержания.Кошка.Пол КАК КошкаПол,
	|	ДоговорОтветственногоСодержания.Кошка.ТипШерсти КАК КошкаТипШерсти
	|ИЗ
	|	Документ.ДоговорОтветственногоСодержания КАК ДоговорОтветственногоСодержания
	|ГДЕ
	|	ДоговорОтветственногоСодержания.Ссылка В(&Ссылка)";
	Запрос.Параметры.Вставить("Ссылка", Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();

	ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	ОбластьШапкаДоговора = Макет.ПолучитьОбласть("ШапкаДоговора");
	ОбластьПредметДоговора = Макет.ПолучитьОбласть("ПредметДоговора");
	ОбластьПраваОбязанностиСторон = Макет.ПолучитьОбласть("ПраваОбязанностиСторон");
	ОбластьОтветственностьСторон = Макет.ПолучитьОбласть("ОтветственностьСторон");
	ОбластьПорядокРазрешенияСпоров = Макет.ПолучитьОбласть("ПорядокРазрешенияСпоров");
	ОбластьДействиеДоговора = Макет.ПолучитьОбласть("ДействиеДоговора");
	ОбластьРеквизитыСторон = Макет.ПолучитьОбласть("РеквизитыСторон");
	
	ТабДок.Очистить();

	ВставлятьРазделительСтраниц = Ложь;
	Пока Выборка.Следующий() Цикл
		Если ВставлятьРазделительСтраниц Тогда
			ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;

		ТабДок.Вывести(ОбластьЗаголовок);
		Табдок.Вывести(ОбластьШапкаДоговора);
		ТабДок.Вывести(ОбластьПредметДоговора);
		ТабДок.Вывести(ОбластьПраваОбязанностиСторон);
		ТабДок.Вывести(ОбластьОтветственностьСторон);
		ТабДок.Вывести(ОбластьПорядокРазрешенияСпоров);
		ТабДок.Вывести(ОбластьДействиеДоговора);
		ТабДок.Вывести(ОбластьРеквизитыСторон);
		
		ВставлятьРазделительСтраниц = Истина;
	КонецЦикла;
	
КонецПроцедуры
