
Процедура Печать(ТабДок, Ссылка) Экспорт
	
	Если НЕ Ссылка.Количество() > 0 Тогда
		Возврат;
	КонецЕсли;
	
	Макет = Документы.ДоговорОтветственногоСодержания.ПолучитьМакет("Печать");
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ДоговорОтветственногоСодержания.Номер КАК Номер,
	|	ДоговорОтветственногоСодержания.Дата КАК Дата,
	|	ДоговорОтветственногоСодержания.Кошка.Код КАК НомерКарточки,
	|	ДоговорОтветственногоСодержания.Кошка.Наименование КАК Кличка,
	|	ДоговорОтветственногоСодержания.Кошка.Порода КАК Порода,
	|	ДоговорОтветственногоСодержания.Кошка.Окрас КАК Окрас,
	|	ДоговорОтветственногоСодержания.Кошка.Пол КАК Пол,
	|	ДоговорОтветственногоСодержания.Кошка.ТипШерсти КАК ТипШерсти,
	|	ВЫБОР
	|		КОГДА ДоговорОтветственногоСодержания.Кошка.ДатаРождения <> ДАТАВРЕМЯ(1, 1, 1)
	|			ТОГДА ВЫБОР
	|					КОГДА МЕСЯЦ(&Период) = МЕСЯЦ(ДоговорОтветственногоСодержания.Кошка.ДатаРождения)
	|							И ДЕНЬ(&Период) < ДЕНЬ(ДоговорОтветственногоСодержания.Кошка.ДатаРождения)
	|						ТОГДА ГОД(&Период) - ГОД(ДоговорОтветственногоСодержания.Кошка.ДатаРождения) - 1
	|					КОГДА МЕСЯЦ(&Период) = МЕСЯЦ(ДоговорОтветственногоСодержания.Кошка.ДатаРождения)
	|							И ДЕНЬ(&Период) > ДЕНЬ(ДоговорОтветственногоСодержания.Кошка.ДатаРождения)
	|						ТОГДА ГОД(&Период) - ГОД(ДоговорОтветственногоСодержания.Кошка.ДатаРождения)
	|					КОГДА МЕСЯЦ(&Период) < МЕСЯЦ(ДоговорОтветственногоСодержания.Кошка.ДатаРождения)
	|						ТОГДА ГОД(&Период) - ГОД(ДоговорОтветственногоСодержания.Кошка.ДатаРождения) - 1
	|					ИНАЧЕ ГОД(&Период) - ГОД(ДоговорОтветственногоСодержания.Кошка.ДатаРождения)
	|				КОНЕЦ
	|		ИНАЧЕ -1
	|	КОНЕЦ КАК ВозрастЛет,
	|	ВЫБОР
	|		КОГДА ДоговорОтветственногоСодержания.Кошка.ДатаРождения <> ДАТАВРЕМЯ(1, 1, 1)
	|			ТОГДА ВЫБОР
	|					КОГДА ДЕНЬ(&Период) >= ДЕНЬ(ДоговорОтветственногоСодержания.Кошка.ДатаРождения)
	|							И МЕСЯЦ(&Период) >= МЕСЯЦ(ДоговорОтветственногоСодержания.Кошка.ДатаРождения)
	|						ТОГДА МЕСЯЦ(&Период) - МЕСЯЦ(ДоговорОтветственногоСодержания.Кошка.ДатаРождения)
	|					КОГДА МЕСЯЦ(&Период) > МЕСЯЦ(ДоговорОтветственногоСодержания.Кошка.ДатаРождения)
	|						ТОГДА МЕСЯЦ(&Период) - МЕСЯЦ(ДоговорОтветственногоСодержания.Кошка.ДатаРождения) - 1
	|					КОГДА ДЕНЬ(&Период) >= ДЕНЬ(ДоговорОтветственногоСодержания.Кошка.ДатаРождения)
	|						ТОГДА 12 - (МЕСЯЦ(ДоговорОтветственногоСодержания.Кошка.ДатаРождения) - МЕСЯЦ(&Период))
	|					ИНАЧЕ 12 - (МЕСЯЦ(ДоговорОтветственногоСодержания.Кошка.ДатаРождения) - МЕСЯЦ(&Период) + 1)
	|				КОНЕЦ
	|		ИНАЧЕ -1
	|	КОНЕЦ КАК ВозрастМесяцев,
	|	НомераМикрочиповСрезПоследних.НомерМикрочипа КАК НомерМикрочипа,
	|	ДокументыФизическихЛицСрезПоследних.Серия КАК ПаспортСерия,
	|	ДокументыФизическихЛицСрезПоследних.Номер КАК ПаспортНомер,
	|	ДокументыФизическихЛицСрезПоследних.ДатаВыдачи КАК ДатаВыдачи,
	|	ДокументыФизическихЛицСрезПоследних.СрокДействия КАК СрокДействия,
	|	ДокументыФизическихЛицСрезПоследних.КемВыдан КАК КемВыдан,
	|	ДокументыФизическихЛицСрезПоследних.КодПодразделения КАК КодПодразделения,
	|	ДоговорОтветственногоСодержания.Укотовитель.ФизическоеЛицо.Телефон КАК УкотовительТелефон,
	|	ДоговорОтветственногоСодержания.Укотовитель.ФизическоеЛицо.МестоЖительства КАК УкотовительМестоЖительства,
	|	ДоговорОтветственногоСодержания.Укотовитель.ФизическоеЛицо.Наименование КАК УкотовительФИО
	|ИЗ
	|	Документ.ДоговорОтветственногоСодержания КАК ДоговорОтветственногоСодержания
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.НомераМикрочипов.СрезПоследних(&Период, ) КАК НомераМикрочиповСрезПоследних
	|		ПО ДоговорОтветственногоСодержания.Кошка = НомераМикрочиповСрезПоследних.Кошка
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДокументыФизическихЛиц.СрезПоследних(&Период, ) КАК ДокументыФизическихЛицСрезПоследних
	|		ПО ДоговорОтветственногоСодержания.Укотовитель.ФизическоеЛицо = ДокументыФизическихЛицСрезПоследних.ФизическоеЛицо
	|ГДЕ
	|	ДоговорОтветственногоСодержания.Ссылка = &Ссылка";
	
	Запрос.Параметры.Вставить("Ссылка", Ссылка[0]);
	Запрос.Параметры.Вставить("Период", ТекущаяДатаСеанса());
	
	РезультатЗапроса =  Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		ОбщегоНазначения.СообщитьПользователю("Ошибка заполнения договора!");
	КонецЕсли;
	Выборка =РезультатЗапроса.Выбрать();
	
	ТабДок.Очистить();
	
	Если Выборка.Следующий() Тогда
	
	//////////////////////////// ЗАГОЛОВОК //////////////////////
	ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	ТабДок.Вывести(ОбластьЗаголовок);
	////////////////////////////
	
	//////////////////////////// ШАПКА ///////////////////////////
	ОбластьШапкаДоговора = Макет.ПолучитьОбласть("ШапкаДоговора");
	ОбластьШапкаДоговора.Параметры.ДатаДоговора = Выборка.Дата;
	ОбластьШапкаДоговора.Параметры.НомерДоговора = Выборка.Номер;
	
	ОбластьШапкаДоговора.Параметры.ПолноеНаименованиеОрганизации = Константы.ПолноеНаименованиеОрганизации.Получить();
	ОбластьШапкаДоговора.Параметры.УкотовительФИО = Выборка.УкотовительФИО;	 
	
	Табдок.Вывести(ОбластьШапкаДоговора);
	//////////////////////////////////////////////////////////////
	
	//////////////////////////// ПРЕДМЕТ ДОГОВОРА ///////////////////////////
	ОбластьПредметДоговора = Макет.ПолучитьОбласть("ПредметДоговора"); 
	ОбластьПредметДоговора.Параметры.НомерКарточки = Выборка.НомерКарточки;
	ОбластьПредметДоговора.Параметры.Кличка = Выборка.Кличка;
	ОбластьПредметДоговора.Параметры.Пол = Выборка.Пол;
	Если Выборка.ВозрастЛет > 0 Тогда
		Возраст = СтрШаблон("%1 г. %2 мес.", Выборка.ВозрастЛет, Выборка.ВозрастМесяцев);
	Иначе
		Возраст = СтрШаблон("%1 мес.", Выборка.ВозрастМесяцев);
	КонецЕсли;
	ОбластьПредметДоговора.Параметры.Возраст = Возраст;
	ОбластьПредметДоговора.Параметры.Окрас = Выборка.Окрас;
	ОбластьПредметДоговора.Параметры.Шерсть = Выборка.ТипШерсти;
	ОбластьПредметДоговора.Параметры.Порода = Выборка.Порода;
	
	
	ТабДок.Вывести(ОбластьПредметДоговора);
	//////////////////////////////////////////////////////////////
	
	//////////////////////////////////////////////////////////////
	ОбластьПраваОбязанностиСторон = Макет.ПолучитьОбласть("ПраваОбязанностиСторон");
	ОбластьПраваОбязанностиСторон.Параметры.УкотовительМестоЖительства = Выборка.УкотовительМестоЖительства;
	
	ОбластьОтветственностьСторон = Макет.ПолучитьОбласть("ОтветственностьСторон");
	ОбластьПорядокРазрешенияСпоров = Макет.ПолучитьОбласть("ПорядокРазрешенияСпоров");
	ОбластьДействиеДоговора = Макет.ПолучитьОбласть("ДействиеДоговора");
	
	ТабДок.Вывести(ОбластьПраваОбязанностиСторон);
	ТабДок.Вывести(ОбластьОтветственностьСторон);
	ТабДок.Вывести(ОбластьПорядокРазрешенияСпоров);
	ТабДок.Вывести(ОбластьДействиеДоговора);
	//////////////////////////////////////////////////////////////
	
	ОбластьРеквизитыСторон = Макет.ПолучитьОбласть("РеквизитыСторон");
	ОбластьРеквизитыСторон.Параметры.ИНН     = Константы.ИНН.Получить();
	ОбластьРеквизитыСторон.Параметры.ОГРН    = Константы.ОГРН.Получить();
	ОбластьРеквизитыСторон.Параметры.Телефон = Константы.ТелефонОрганизации.Получить();
	ОбластьРеквизитыСторон.Параметры.АдресЭП  = Константы.АдресЭлектроннойПочтыОрганизации.Получить();
	
	ОбластьРеквизитыСторон.Параметры.УкотовительФИО = Выборка.УкотовительФИО;
	ОбластьРеквизитыСторон.Параметры.ПаспортСерия   = Выборка.ПаспортСерия;
	ОбластьРеквизитыСторон.Параметры.ПаспортНомер   = Выборка.ПаспортНомер;
	ОбластьРеквизитыСторон.Параметры.ПаспортВыдан   = СтрШаблон("%1, %2", Выборка.КемВыдан, Выборка.ДатаВыдачи);
	ОбластьРеквизитыСторон.Параметры.УкотовительТелефон = Выборка.УкотовительТелефон;
	
	ТабДок.Вывести(ОбластьРеквизитыСторон);
	КонецЕсли;

КонецПроцедуры
