
Процедура Печать(ТабДок, Ссылка) Экспорт
	
	Если НЕ Ссылка.Количество() > 0 Тогда
		Возврат;
	КонецЕсли;
	
	Макет = Документы.ДоговорОтветственногоСодержания.ПолучитьМакет("Печать");
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ДоговорОтветственногоСодержания.Номер КАК Номер,
	|	ДоговорОтветственногоСодержания.Дата КАК Дата,
	|	ДоговорОтветственногоСодержания.Номер КАК НомерКарточки,
	|	ДоговорОтветственногоСодержания.Кошка.Наименование КАК Кличка,
	|	ДоговорОтветственногоСодержания.Кошка.Порода КАК Порода,
	|	ДоговорОтветственногоСодержания.Кошка.Окрас КАК Окрас,
	|	ДоговорОтветственногоСодержания.Кошка.Пол КАК Пол,
	|	ДоговорОтветственногоСодержания.Кошка.ТипШерсти КАК ТипШерсти,
	|	РАЗНОСТЬДАТ(ДоговорОтветственногоСодержания.Кошка.ДатаРождения, &ТекущаяДата, ГОД) КАК ВозрастГоды,
	|	РАЗНОСТЬДАТ(ДоговорОтветственногоСодержания.Кошка.ДатаРождения, &ТекущаяДата, МЕСЯЦ) - РАЗНОСТЬДАТ(ДоговорОтветственногоСодержания.Кошка.ДатаРождения, &ТекущаяДата, ГОД) * 12 КАК ВозрастМесяцы,
	|	НомераМикрочиповСрезПоследних.НомерМикрочипа КАК НомерМикрочипа,
	|	ДокументыФизическихЛицСрезПоследних.Серия КАК СерияПаспорта,
	|	ДокументыФизическихЛицСрезПоследних.Номер КАК НомерПаспорта,
	|	ДокументыФизическихЛицСрезПоследних.ДатаВыдачи КАК ДатаВыдачи,
	|	ДокументыФизическихЛицСрезПоследних.СрокДействия КАК СрокДействия,
	|	ДокументыФизическихЛицСрезПоследних.КемВыдан КАК КемВыдан,
	|	ДокументыФизическихЛицСрезПоследних.КодПодразделения КАК КодПодразделения,
	|	ДоговорОтветственногоСодержания.Укотовитель.ФизическоеЛицо.Телефон КАК УкотовительФизическоеЛицоТелефон,
	|	ДоговорОтветственногоСодержания.Укотовитель.ФизическоеЛицо.МестоЖительства КАК УкотовительФизическоеЛицоМестоЖительства
	|ИЗ
	|	Документ.ДоговорОтветственногоСодержания КАК ДоговорОтветственногоСодержания
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.НомераМикрочипов.СрезПоследних КАК НомераМикрочиповСрезПоследних
	|		ПО ДоговорОтветственногоСодержания.Кошка = НомераМикрочиповСрезПоследних.Кошка
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДокументыФизическихЛиц.СрезПоследних КАК ДокументыФизическихЛицСрезПоследних
	|		ПО ДоговорОтветственногоСодержания.Укотовитель.ФизическоеЛицо = ДокументыФизическихЛицСрезПоследних.ФизическоеЛицо
	|ГДЕ
	|	ДоговорОтветственногоСодержания.Ссылка = &Ссылка";
	Запрос.Параметры.Вставить("Ссылка", Ссылка[0]);
	Запрос.Параметры.Вставить("ТекущаяДата", ТекущаяДатаСеанса());
	
	РезультатЗапроса =  Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		ОбщегоНазначения.СообщитьПользователю("Ошибка заполнения договора!");
	КонецЕсли;
	Выборка =РезультатЗапроса.Выбрать();
	
	ТабДок.Очистить();
	
	Если Выборка.Следующий() Тогда
	//////////////////////////// ЗАГОЛОВОК //////////////////////
	ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	ТабДок.Вывести(ОбластьЗаголовок);
	////////////////////////////
	
	//////////////////////////// ШАПКА ///////////////////////////
	ОбластьШапкаДоговора = Макет.ПолучитьОбласть("ШапкаДоговора");
	ОбластьШапкаДоговора.Параметры.ДатаДоговора = Выборка.Дата;
	ОбластьШапкаДоговора.Параметры.НомерДоговора = Выборка.Номер;
	
	ОбластьШапкаДоговора.Параметры.УправляющаяОрганизацияПриюта = Константы.НаименованиеОрганизации.Получить();
	//ОбластьШапкаДоговора.ДиректорПриюта 
	
	Табдок.Вывести(ОбластьШапкаДоговора);
	//////////////////////////////////////////////////////////////
	
	//////////////////////////// ПРЕДМЕТ ДОГОВОРА ///////////////////////////
	ОбластьПредметДоговора = Макет.ПолучитьОбласть("ПредметДоговора"); 
	ОбластьПредметДоговора.Параметры.НомерКарточки = Выборка.НомерКарточки;
	ОбластьПредметДоговора.Параметры.Кличка = Выборка.Кличка;
	ОбластьПредметДоговора.Параметры.Пол = Выборка.Пол;
	ОбластьПредметДоговора.Параметры.Возраст = СтрШаблон("%1 г. %2 мес.", Выборка.ВозрастГоды, Выборка.ВозрастМесяцы);
	ОбластьПредметДоговора.Параметры.Окрас = Выборка.Окрас;
	ОбластьПредметДоговора.Параметры.Шерсть = Выборка.ТипШерсти;
	ОбластьПредметДоговора.Параметры.Порода = Выборка.Порода;
	
	
	ТабДок.Вывести(ОбластьПредметДоговора);
	//////////////////////////////////////////////////////////////
	
	//////////////////////////////////////////////////////////////
	ОбластьПраваОбязанностиСторон = Макет.ПолучитьОбласть("ПраваОбязанностиСторон");
	ОбластьОтветственностьСторон = Макет.ПолучитьОбласть("ОтветственностьСторон");
	ОбластьПорядокРазрешенияСпоров = Макет.ПолучитьОбласть("ПорядокРазрешенияСпоров");
	ОбластьДействиеДоговора = Макет.ПолучитьОбласть("ДействиеДоговора");
	
	ТабДок.Вывести(ОбластьПраваОбязанностиСторон);
	ТабДок.Вывести(ОбластьОтветственностьСторон);
	ТабДок.Вывести(ОбластьПорядокРазрешенияСпоров);
	ТабДок.Вывести(ОбластьДействиеДоговора);
	//////////////////////////////////////////////////////////////
	
	ОбластьРеквизитыСторон = Макет.ПолучитьОбласть("РеквизитыСторон");
	ОбластьРеквизитыСторон.Параметры.ИНН = Константы.ИНН.Получить();
	ОбластьРеквизитыСторон.Параметры.ОГРН = Константы.ОГРН.Получить();
	ОбластьРеквизитыСторон.Параметры.Телефон = Константы.ТелефонОрганизации.Получить();
	//ОбластьРеквизитыСторон.Параметры.ФИОРуководителя = Константы.Рук;
	ТабДок.Вывести(ОбластьРеквизитыСторон);
	КонецЕсли;

КонецПроцедуры
