
Процедура ОбработкаПроведения(Отказ, Режим)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СтатусыМестаСодержанияЖивотныхСрезПоследних.МестоСодержания КАК МестоСодержания
		|ИЗ
		|	РегистрСведений.СтатусыМестаСодержанияЖивотных.СрезПоследних(&Период, Кошка = &Кошка) КАК СтатусыМестаСодержанияЖивотныхСрезПоследних";
	
	Запрос.УстановитьПараметр("Кошка", Кошка);
	Запрос.УстановитьПараметр("Период", Дата);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		ТекстОшибки = СтрШаблон("Не удалось определить место содержания %1!", Кошка.Наименование);
		ОбщегоНазначения.СообщитьПользователю(ТекстОшибки);
	КонецЕсли;
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Если Выборка.Следующий() Тогда
		Комната = Выборка.МестоСодержания;
	КонецЕсли;
	
	// регистр СтатусыМестаСодержанияЖивотных
	Движения.СтатусыМестаСодержанияЖивотных.Записывать = Истина;
	Движение = Движения.СтатусыМестаСодержанияЖивотных.Добавить();
	Движение.Период             = Дата;
	Движение.Кошка              = Кошка;
	Движение.Статус             = Перечисления.СтатусыПребыванияЖивотных.Укотовлен;
	Движение.ПричинаПеремещения = Справочники.ПричиныПеремещенияЖивотных.Укотовление;

	// регистр ЗаполненностьКомнат Расход
	Движения.ЗаполненностьКомнат.Записывать = Истина;
	Движение = Движения.ЗаполненностьКомнат.Добавить();
	Движение.ВидДвижения     = ВидДвиженияНакопления.Расход;
	Движение.Период          = Дата;
	Движение.Комната         = Комната;
	Движение.КоличествоКотов = 1;

КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)

	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.Собеседование") Тогда
		Кошка         = ДанныеЗаполнения.Кошка;
		Собеседование = ДанныеЗаполнения.Ссылка;
		Укотовитель   = ДанныеЗаполнения.Укотовитель;
	КонецЕсли;

КонецПроцедуры
