
&НаКлиенте
Процедура ФизическоеЛицоПриИзменении(Элемент)
	
	Объект.Наименование = ФИО();
	
КонецПроцедуры

&НаСервере
Функция ФИО()
	
	СтруктураФИО = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Объект.ФизическоеЛицо, "Наименование");
	
	// TODO: Проверка, что наименование получено
	
	Возврат СтруктураФИО.Наименование;
	
КонецФункции

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Кошки.Параметры.УстановитьЗначениеПараметра("ФизическоеЛицо", Объект.ФизическоеЛицо);
		Кошки.Параметры.УстановитьЗначениеПараметра("ОпекунУкотовитель",Объект.ОпекунУкотовитель);
	КонецЕсли;
	
КонецПроцедуры
