
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если НЕ ЭтаФорма.Объект.Ссылка = Неопределено Тогда
		
		ЗаполнитьВес();
	
		ЗаполнитьНомерЧипа();
	
		ОбновитьФотографии();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьВес()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	РезультатыВзвешиванийСрезПоследних.Вес КАК Вес,
		|	РезультатыВзвешиванийСрезПоследних.Регистратор КАК Регистратор
		|ИЗ
		|	РегистрСведений.РезультатыВзвешиваний.СрезПоследних(&Период, Кошка = &Кошка) КАК РезультатыВзвешиванийСрезПоследних";
	
	Запрос.УстановитьПараметр("Кошка", ЭтаФорма.Объект.Ссылка);
	Запрос.УстановитьПараметр("Период", ТекущаяДатаСеанса());
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Если Выборка.Следующий() Тогда
		ЭтаФорма.Вес = Выборка.Вес;
		ЭтаФорма.ДокументВзвешивания = Выборка.Регистратор;
	Иначе
		ЭтаФорма.Вес = 0.0;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьНомерЧипа()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	НомераМикрочиповСрезПоследних.НомерМикрочипа КАК НомерМикрочипа
		|ИЗ
		|	РегистрСведений.НомераМикрочипов.СрезПоследних(&Период, Кошка = &Кошка) КАК НомераМикрочиповСрезПоследних";
	
	Запрос.УстановитьПараметр("Кошка", ЭтаФорма.Объект.Ссылка);
	Запрос.УстановитьПараметр("Период", ТекущаяДатаСеанса());
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Если Выборка.Следующий() Тогда
		ЭтаФорма.НомерМикрочипа = Выборка.НомерМикрочипа;
	Иначе
		ЭтаФорма.НомерМикрочипа = "ХХХХХХХХХХХХХХХ";
	КонецЕсли;;
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьФотографии()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ФотографииКошек.ФотографияКошки КАК Фотография
	|ИЗ
	|	РегистрСведений.ФотографииКошек КАК ФотографииКошек
	|ГДЕ
	|	ФотографииКошек.Кошка = &Кошка";
	Запрос.УстановитьПараметр("Кошка", Объект.Ссылка);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Фотографии.Очистить();
	Пока Выборка.Следующий() Цикл
		Фотографии.Добавить(Выборка.Фотография);
	КонецЦикла;
	
	Если Фотографии.Количество() > 0 Тогда
		ОтобразитьКартинку();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОтобразитьКартинку()
	АдресКартинки = ПоместитьВоВременноеХранилище(Фотографии.Получить(ИндексКартинки).Значение.Получить());
КонецПроцедуры

&НаКлиенте
Процедура ЛистатьВлево(Команда)
	ИндексКартинки = ?(ИндексКартинки = 0, Фотографии.Количество()-1, ИндексКартинки - 1);
	ОтобразитьКартинку();
КонецПроцедуры

&НаКлиенте
Процедура ЛистатьВправо(Команда)
	ИндексКартинки = ?(ИндексКартинки = Фотографии.Количество()-1, 0, ИндексКартинки + 1);
	ОтобразитьКартинку();
КонецПроцедуры